main.floors.MT1=
{
    "floorId": "MT1",
    "title": "prts内部",
    "name": "1",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": null,
    "ratio": 1,
    "defaultGround": "grass",
    "firstArrive": [
        {
            "type": "showStatusBar"
        },
        {
            "type": "playSound",
            "name": "prts.wav"
        },
        "\t[prts.png]欢迎进入PRTS使用教程，博士",
        {
            "type": "playSound",
            "name": "prts.wav"
        },
        "\t[prts.png]我将在这里讲解PRTS记忆系统的各种内容",
        {
            "type": "playSound",
            "name": "prts.wav"
        },
        "\t[prts.png]为了方便讲解",
        {
            "type": "playSound",
            "name": "prts.wav"
        },
        "\t[prts.png]我们先在这个空间中用虚拟凯尔希进行教程",
        {
            "type": "playSound",
            "name": "prts.wav"
        },
        "\t[prts.png]现在成功载入了虚拟凯尔希的数据",
        {
            "type": "playSound",
            "name": "prts.wav"
        },
        "\t[prts.png]在你屏幕上显示各种数值的，是“状态栏”",
        {
            "type": "playSound",
            "name": "prts.wav"
        },
        "\t[prts.png]分别是人物的名字（白色）",
        {
            "type": "playSound",
            "name": "prts.wav"
        },
        "\t[prts.png]源石技艺值（蓝色）",
        {
            "type": "playSound",
            "name": "prts.wav"
        },
        "\t[prts.png]生命值（十字图标后的数值）",
        {
            "type": "playSound",
            "name": "prts.wav"
        },
        "\t[prts.png]攻击力（交叉双剑图标后的数值）",
        {
            "type": "playSound",
            "name": "prts.wav"
        },
        "\t[prts.png]防御力（盾牌图标后的数值）",
        {
            "type": "playSound",
            "name": "prts.wav"
        },
        "\t[prts.png]护盾值（多个盾牌图标后的数值）",
        {
            "type": "playSound",
            "name": "prts.wav"
        },
        "\t[prts.png]源石值（亦叫感染值，“G”图标后的数值）",
        {
            "type": "playSound",
            "name": "prts.wav"
        },
        "\t[prts.png]还有各种图标及数值，它们的作用会在之后讲解",
        {
            "type": "playSound",
            "name": "prts.wav"
        },
        "\t[prts.png]那么，先让你操纵的角色热个身吧",
        {
            "type": "playSound",
            "name": "prts.wav"
        },
        "\t[prts.png]请使用AWSD进行移动，手机端玩家可以点击想去的位置来移动",
        {
            "type": "playSound",
            "name": "prts.wav"
        },
        "\t[prts.png]准备好后，请走到面前的铁门处我们来进行下一步的动作",
        "\t[prts.png]为了方便讲解，也照顾一下作者这个懒狗，我在下面的教程关不会有音效了",
        {
            "type": "hideImage",
            "code": 1,
            "time": 0
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "3,11": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                {
                    "type": "openDoor",
                    "loc": [
                        3,
                        11
                    ]
                },
                "\t[prts.png]很好，博士，看来你已经会走了",
                "\t[prts.png]咳咳，不开玩笑了",
                "\t[prts.png]但是话说的好，天底下没有免费的晚餐，门也不会白白给你开",
                "\t[prts.png]一般的门你是没法直接打开的，你需要“钥匙”才可以",
                "\t[prts.png]记忆空间是有很多门的存在的，它们一般是某种选择或者挫折的象征，我们当前读取记忆所经历的挫折或选择越多，门就会越多，而我们作为观察者，想要通过便需要找到“钥匙”",
                "\t[prts.png]同时，黄色的门需要黄钥匙打开，蓝色的门需要蓝钥匙打开...以此类推",
                "\t[prts.png]拾取你前方的黄钥匙，打开这个黄门吧",
                {
                    "type": "hide",
                    "loc": [
                        [
                            3,
                            11
                        ]
                    ],
                    "remove": true
                }
            ]
        },
        "10,12": [
            "看来这个墙故意被设计成了一推就倒的样子......",
            {
                "type": "hide",
                "loc": [
                    [
                        10,
                        12
                    ]
                ],
                "remove": true
            }
        ],
        "11,9": [
            "\t[prts.png]哦,一个野生的源石虫出现了",
            "\t[prts.png]它似乎不想让你通过，看来只有一战了",
            "\t[prts.png]慢着，在一战之前，我们需要先看看他的能力",
            {
                "type": "hide",
                "loc": [
                    [
                        11,
                        9
                    ]
                ],
                "remove": true
            }
        ],
        "9,7": [
            "\t[prts.png]现在来介绍一下临界及减伤",
            "\t[prts.png]我们先来看一下下面的几种源石吧！",
            "\t[prts.png]红色源石可以增加你的攻击力，蓝色源石可以增加你的防御力，而绿色源石则可以增加你的护盾值",
            {
                "type": "hide",
                "remove": true
            }
        ],
        "11,7": [
            "\t[prts.png]你在刚才的界面中，可以看到该敌人的生命值，攻击力，防御力，感染值以及伤害",
            "\t[prts.png]比如你面前的这个源石虫，他的生命值是10，攻击力是20，防御力是9，感染值是10而伤害是80",
            "\t[prts.png]再确认一次吧，我帮你打开手册",
            {
                "type": "callBook"
            },
            "\t[prts.png]唔姆唔姆，生命值就是敌人的生命，当其全部消失敌人便会死亡",
            "\t[prts.png]感染值则是你打败其之后你的源石值加剧的数值体现，不能多和感染生物接触哦",
            "\t[prts.png]攻击力便是敌人进攻效果的一个数据化，敌人每次对你造成的伤害为（敌人的攻击力-你的防御力）",
            "\t[prts.png]防御力便是敌人防守程度的一个数据化，你每次对敌人造成的伤害为（你的攻击力-敌人的防御力）",
            "\t[prts.png]本系统中的战斗是回合制，通常情况下，是你先打敌人一下，敌人再打你一下",
            "\t[prts.png]直到一方生命归0",
            "\t[prts.png]伤害则是经历本次战斗后你会失去的生命值，而你的护盾值属性则可以抵挡相应数值的伤害",
            "\t[prts.png]你的攻击是10，每次对其造成1点伤害，你需要攻击其十次才能打倒它，所以它在这期间会攻击你9次",
            "\t[prts.png]他的攻击力是20，每次对你造成10点伤害，攻击你九次，你本来该受到90点伤害才对",
            "\t[prts.png]诶，但是你有10点护盾，所以降低10，变成了80",
            "\t[prts.png]博士你可能会问，我还看到了临界，临界是什么玩意？",
            "\t[prts.png]别急嘛博士，我们继续前进",
            {
                "type": "hide",
                "loc": [
                    [
                        11,
                        7
                    ]
                ],
                "remove": true
            }
        ],
        "1,5": [
            "\t[prts.png]现在进入实战测试，看看你对于源石的获取以及战斗是否有了一些理解！",
            "\t[prts.png]我会微调一下你的属性，让这些源石虫变得可怕一些",
            "\t[prts.png]记住，无论如何，第一目标都是伤害最低化",
            "\t[prts.png]一般而言，攻击力的优先级往往是最高的",
            "\t[prts.png]\r[aqua]消灭所有源石虫后可以进入下一个教程\r",
            {
                "type": "setValue",
                "name": "status:atk",
                "value": "10"
            },
            {
                "type": "setValue",
                "name": "status:def",
                "value": "0"
            },
            {
                "type": "setValue",
                "name": "status:hp",
                "operator": "-=",
                "value": "628"
            },
            {
                "type": "hide",
                "loc": [
                    [
                        1,
                        5
                    ]
                ],
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "6,0": {
            "floorId": "MT2",
            "loc": [
                6,
                11
            ]
        }
    },
    "afterBattle": {
        "2,7": [
            "\t[prts.png]经历了多次战斗后，你的血量已经减少了",
            "\t[prts.png]这个是伤药，战场上很常见的物资，比如这个红色止血粉，它目前可以恢复你100点生命值",
            "\t[prts.png]顺便来介绍一下我们可爱的机关门，它需要你达成某种条件才能打开，比如这个...试着先恢复一下生命值？"
        ],
        "10,7": [
            "\t[prts.png]战斗方式一般都是你刚才进行的形式",
            "\t[prts.png]通过接触，然后直接战斗并跳过战斗过程",
            "\t[prts.png]你所受到的伤害便是其伤害值",
            "\t[prts.png]如果你的血量小于其伤害值，则无法战斗（因为人被杀就会死）"
        ],
        "3,3": [
            {
                "type": "setValue",
                "name": "flag:door_MT1_6_3",
                "operator": "+=",
                "value": "1"
            }
        ],
        "1,3": [
            {
                "type": "setValue",
                "name": "flag:door_MT1_6_3",
                "operator": "+=",
                "value": "1"
            }
        ],
        "9,3": [
            {
                "type": "setValue",
                "name": "flag:door_MT1_6_3",
                "operator": "+=",
                "value": "1"
            }
        ],
        "11,3": [
            {
                "type": "setValue",
                "name": "flag:door_MT1_6_3",
                "operator": "+=",
                "value": "1"
            }
        ],
        "1,1": [
            {
                "type": "setValue",
                "name": "flag:door_MT1_6_3",
                "operator": "+=",
                "value": "1"
            }
        ],
        "3,1": [
            {
                "type": "setValue",
                "name": "flag:door_MT1_6_3",
                "operator": "+=",
                "value": "1"
            }
        ],
        "9,1": [
            {
                "type": "setValue",
                "name": "flag:door_MT1_6_3",
                "operator": "+=",
                "value": "1"
            }
        ],
        "11,1": [
            {
                "type": "setValue",
                "name": "flag:door_MT1_6_3",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {
        "5,11": [
            "\t[prts.png]恭喜你成功拾取一个黄钥匙~",
            "\t[prts.png]你会发现左边的状态栏的黄色数字发生了变化！这就是你的黄钥匙数量",
            "\t[prts.png]欸？为什么要时刻让你知道你的黄钥匙数量呢？"
        ],
        "11,8": [
            "\t[prts.png]也许我们读取记忆的个体当时是仅凭一身之勇，经验抑或运气通过了险阻，但我们可以知道面前敌人的属性及能力再去考虑是否作战",
            "\t[prts.png]你现在获得了读取敌对生物能力的能力，试着按屏幕左边的上边第一个按钮或者按下“X”来看一看他们的能力吧！"
        ],
        "0,7": [
            {
                "type": "openDoor",
                "loc": [
                    1,
                    6
                ]
            },
            "\t[prts.png]很好，博士你载入的角色恢复了150生命值，门也开了",
            "\t[prts.png]啊？博士你说什么？",
            "\t[prts.png]“不是说恢复100点吗？”",
            "\t[prts.png]这个啊，等会再和你说"
        ],
        "6,7": [
            "\t[prts.png]这种小型\r[aqua]温和源石\r可以增加你一点防御值",
            "\t[prts.png]唔姆唔姆，因为根据刚才的计算，他会攻击你9次，所以这个蓝色源石可以让它的伤害减少9点~",
            "\t[prts.png]而你刚看到的“1防：9”",
            "\t[prts.png]这说明你在攻击这个源石虫上每捡一点防御力就会获得9点的伤害减免",
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        8
                    ]
                ],
                "remove": true
            }
        ],
        "4,7": [
            "\t[prts.png]哦吼，让我们重点介绍一下\r[red]刺激型源石",
            "\t[prts.png]如你所见，这种红色的源石目前可以增加你一点攻击力",
            "\t[prts.png]你之前需要攻击它十次，而现在你只需要攻击五次就行了",
            "\t[prts.png]那么你就可以少挨五次打~",
            "\t[prts.png]同时，如果\r[gold]你的攻击力小于敌人的防御力\r那么你的普通攻击将无法对敌人造成伤害",
            "\t[prts.png]但并不是所有情况下你捡攻击力都可以使其伤害减少的！比如你打一个9血的敌人，每次造成3点伤害和每次造成4点伤害其实都需要攻击三次",
            "\t[prts.png]而你刚刚看到的“临界：1”",
            "\t[prts.png]就说明你只要\r[gold]再捡一点攻击力\r就可以让敌人的伤害减小",
            {
                "type": "hide",
                "loc": [
                    [
                        4,
                        8
                    ]
                ],
                "remove": true
            }
        ],
        "8,7": [
            "\t[prts.png]这种小型\r[lime]护盾源石\r增加你5点的护盾值，每点护盾值可以抵挡一点伤害。你看前面源石虫的伤害，是不是少了五点？",
            {
                "type": "hide",
                "loc": [
                    [
                        8,
                        8
                    ]
                ],
                "remove": true
            }
        ],
        "11,2": [
            {
                "type": "if",
                "condition": "(status:mdef!==20)",
                "true": [
                    "\t[prts.png]不不不",
                    "\t[prts.png]博士你可以读档之后看一眼敌人属性",
                    "\t[prts.png]防御当时的减伤是4，而护盾是5",
                    "\t[prts.png]很明显，先捡护盾更合适"
                ]
            }
        ]
    },
    "afterOpenDoor": {
        "6,11": [
            "\t[prts.png]恭喜你打开了这个门~",
            "\t[prts.png]但值得注意的是，你会发现左边的黄色数字发生了减少",
            "\t[prts.png]换句话说，你的黄钥匙在打开这个黄门之后-1了",
            "\t[prts.png]同一个办法不能用在两个地方上，圣斗士不会被同样的招数打败两次",
            "\t[prts.png]一把黄钥匙，当然只能开一个黄门啦",
            "\t[prts.png]继续前进吧~"
        ],
        "9,11": [
            {
                "type": "setBlock",
                "number": "X10231",
                "loc": [
                    [
                        10,
                        11
                    ]
                ]
            },
            "\t[prts.png]哦！不！看起来前面似乎无法通过，另外的蓝门才是入口！",
            "\t[prts.png]但是你已经用完了仅有的蓝钥匙，怎么办？",
            "\t[prts.png]不用担心，PRTS系统有读档及存档功能",
            "\t[prts.png]你可以通过按屏幕左方（手机端在下方）的按钮来读/存档，或者按按键S来存档，按键D来读档",
            "\t[prts.png]什么？你刚才没存档？",
            "\t[prts.png]值得注意的是，这个系统配备了自动存档系统，你的每一个开门关门及节点操作都会自动存档。你点开读档系统，读取自动自动存档或者直接按a就可以了~"
        ]
    },
    "autoEvent": {
        "6,3": {
            "0": {
                "condition": "flag:door_MT1_6_3==8",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_MT1_6_3",
                        "operator": "=",
                        "value": "null"
                    }
                ]
            },
            "1": null
        }
    },
    "cannotMove": {},
    "map": [
    [10052,10052,10052,10052,10052,10052, 91,10052,10052,10052,10052,10052,10052],
    [10052,201,10052,201,10052,103,  0,103,10052,201,10052,201,10052],
    [10052, 27,10052, 31,10052,  0,168,  0,10052, 29,10052, 28,10052],
    [10052,201,10052,201,10052,10052, 85,10052,10052,201,10052,201,10052],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,10052,10052,10052,10052,10052,10052,10052,  0,  0,  0],
    [10052, 85,10052,10052,  0,10052,  0,10052,  0,10052,10052,10052,10052],
    [ 31,  0,201,  0, 27,  0, 28,  0, 29,  0,201,  0,  0],
    [  0,  0,  0,10052,  0,10052,  0,10052,  0,10052,103, 45,103],
    [10052,10052,10052,10052,10052,10052,10052,10052,10052,10052,10052,  0,10052],
    [  0,  0,  0,10052,  0,  0,10052,  0,  0, 82,10052,  0,  0],
    [  0,  0,  0,105,  0, 21, 81,  0, 22, 82, 17,  0,  0],
    [  0,  0,  0,10052,  0,  0,10052,  0,  0, 82,10052,  0,  0]
],
    "bgmap": [
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10052],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000],
    [10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000,10000]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,103,  0,  0,  0,  0,  0,103,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgm": "bg.mp3"
}