main.floors.MT15=
{
    "floorId": "MT15",
    "title": "",
    "name": "西北冻原",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X20000",
    "bgm": "bg.mp3",
    "firstArrive": [
        "\t[纠察队士官长]\f[jcd.png:x,100,0]该死！该死！",
        "\t[纠察队士官长]\f[jcd.png:x,100,0]这个感染者是怎么回事？仿佛邪神一般......",
        {
            "type": "animate",
            "name": "jy",
            "loc": [
                6,
                10
            ]
        },
        "\t[纠察队士官长]\f[jcd.png:x,100,0]...来......来了",
        {
            "type": "move",
            "loc": [
                6,
                10
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "up:2"
            ]
        },
        "\t[塔露拉]\f[tll.png,-100,0]阿阿，看来你们惹到她了",
        "\t[纠察队士官长]\f[jcd.png:x,100,0]......什么？",
        "\t[塔露拉]\f[tll.png,-100,0]啊，没什......",
        "\t[塔露拉]\f[tll.png,-100,0]——？",
        {
            "type": "showImage",
            "code": 1,
            "image": "dark.png",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        "\t[塔露拉]\f[tll.png,0,0]\r[red]死吧",
        {
            "type": "pauseBgm"
        },
        {
            "type": "battle",
            "id": "E342"
        },
        {
            "type": "playSound",
            "name": "Fire1.ogg"
        },
        {
            "type": "vibrate",
            "direction": "horizontal",
            "time": 1000,
            "speed": 10,
            "power": 10,
            "async": true
        },
        {
            "type": "playBgm",
            "name": "piaobo.mp3",
            "keep": true
        },
        "\t[纠察队士官长]呃呃呃呃呃！",
        "\t[纠察队士官长]啊啊......啊啊啊啊！",
        "\t[塔露拉]\f[tll.png,0,0]......",
        {
            "type": "showImage",
            "code": 2,
            "image": "country.png",
            "loc": [
                -100,
                0
            ],
            "opacity": 1,
            "time": 1000
        },
        {
            "type": "waitAsync"
        },
        {
            "type": "playSound",
            "name": "run.wav"
        },
        {
            "type": "showImage",
            "code": 3,
            "image": "alnj.png",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 1000
        },
        "\t[阿丽娜]塔露拉......！你...唔......！",
        "\t[阿丽娜]这把火是你放的吗？他们是你烧......呃！",
        {
            "type": "hideImage",
            "code": 3,
            "time": 0
        },
        "\t[塔露拉]\f[tllb.png,0,0]阿丽娜，抱歉，这一定会给村子带来很大的灾难，但是我无法忍受",
        "\t[塔露拉]\f[tllb.png,0,0]我无法忍受这种事情",
        "\t[塔露拉]\f[tllb.png,0,0]......阿丽娜？",
        "塔露拉惊讶地看着阿丽娜。阿丽娜用塔露拉从没见过的眼神望着她。",
        {
            "type": "showImage",
            "code": 3,
            "image": "alnj.png",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        "\t[阿丽娜]你眼里有一团火。",
        "\t[阿丽娜]从你来这个村子的时候我就知道，你不会甘心在这个村子里呆下去的。",
        "\t[阿丽娜]你有你的来处，你从哪里来就要回到哪里去，这个村子容不下你。",
        {
            "type": "hideImage",
            "code": 3,
            "time": 0
        },
        "\t[塔露拉]\f[tll.png,0,0]我不会回去。别这么看着我......",
        "\t[阿丽娜]但你眼里确实有那一团火。",
        "\t[阿丽娜]你想要点燃什么，你想烧掉什么，你觉得这一切都不对，你在忍受，你忍到了极限......",
        "\t[阿丽娜]不该是现在，塔露拉。不该是现在。",
        "\t[阿丽娜]村民是无辜的。你一时的怒火只会害了他们。",
        {
            "type": "hideImage",
            "code": 3,
            "time": 0
        },
        "\t[塔露拉]\f[tlln.png,0,0]可是......",
        {
            "type": "playSound",
            "name": "soldiers.wav"
        },
        "\t[塔露拉]\f[tlln.png,0,0]该死，他们没有死绝，叫来了增援......",
        "\t[感染者纠察队]发生什么事——天哪！发生什么了！谁！是谁干的！",
        "\t[老妇]\f[lfj.png,0,0]塔露拉！塔露拉！！走啊，走！！别回来了！！别回来！！",
        "\t[塔露拉]\f[tllb.png,0,0]奶奶，连你也...",
        "\t[老妇]\f[lfj.png,0,0]陛下保佑，保佑我这个女儿一样的女儿吧，保佑她活下去，保佑她好好活下去啊！！",
        "\t[阿丽娜]\f[alnj.png,0,0]塔露拉，我们快走！",
        "\t[塔露拉]\f[tllf.png,0,0]不行......那些可恨的纠察队！",
        "\t[阿丽娜]\f[alnj.png,0,0]我们是感染者，村子里的人可不是！",
        "\t[塔露拉]\f[tlln.png,0,0]......你说什么？",
        "\t[阿丽娜]\f[alnj.png,0,0]我也是感染者，塔露拉。我也是。",
        {
            "type": "hideImage",
            "code": 2,
            "time": 1000
        },
        {
            "type": "showImage",
            "code": 2,
            "image": "snow.png",
            "loc": [
                -150,
                0
            ],
            "opacity": 1,
            "time": 1000
        },
        {
            "type": "playSound",
            "name": "run.wav"
        },
        "\t[阿丽娜]呼，呼......这里是......我们准备迁移过来的地方。地方已经建好了......可是......",
        {
            "type": "showImage",
            "code": 3,
            "image": "tlla.png",
            "loc": [
                100,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        {
            "type": "showImage",
            "code": 4,
            "image": "alna.png",
            "loc": [
                -100,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        "\t[塔露拉]\f[tll.png,100,0]他们......爷爷他......",
        "\t[塔露拉]\f[tllb.png,100,0]不能让他们再这么做.......不能让他们......",
        "\t[阿丽娜]\f[alnj.png,-100,0]他救了你，救了我，救了全村的人。",
        "\t[阿丽娜]\f[alnj.png,-100,0]你却......搅黄了老爸爸他的计划。",
        "\t[塔露拉]\f[tllb.png,100,0]你在说什么？那些村民，他们举报了——",
        "\t[塔露拉]\f[tllf.png,100,0]......等等。你是说，举报爷爷他的，是......",
        "\t[阿丽娜]\f[alnj.png,-100,0]是爷爷他自己。因为这样，纠察队就不会再查下去，情况理想的话，就是这样。",
        "\t[阿丽娜]\f[alnj.png,-100,0]你再有实力也对抗不了数支纠察队。",
        "\t[塔露拉]\f[tllf.png,100,0]我能。",
        "\t[阿丽娜]\f[alnj.png,-100,0]这之后呢？要是宪兵来了呢？城市驻军和贵族老爷们的士兵来了呢？",
        "\t[塔露拉]\f[tllf.png,100,0]我们只是没有足够的力量，等我们积攒了足够的实力......",
        "\t[塔露拉]\f[tllf.png,100,0]那并不对。不对，这事情不该这么看！",
        "\t[塔露拉]\f[tllf.png,100,0]看着邪恶的事情在眼前发生却视而不见，只求自保，这并不对！",
        "\t[塔露拉]\f[tllf.png,100,0]......这是自私，甚至无情的行为。",
        "\t[塔露拉]\f[tllf.png,100,0]如果公义需要更多暴力才能伸张，那还怎么能被称得上是公义？",
        "\t[阿丽娜]\f[alnj.png,-100,0]我还回答不了你这种问题，塔露拉。你读的书比我多，我知道的。",
        "\t[阿丽娜]\f[alnj.png,-100,0]但这个村子今天已经死了一个人了。今天不应该再死更多人。",
        "\t[阿丽娜]\f[alnj.png,-100,0]你是很聪明的，你能想明白。",
        "\t[阿丽娜]\f[alnj.png,-100,0]走吧，塔露拉！",
        "\t[塔露拉]\f[tll.png,100,0]......我会回来。",
        "\t[阿丽娜]\f[alnj.png,-100,0]和自己说吧，塔露拉。和自己说。",
        {
            "type": "pauseBgm"
        },
        {
            "type": "hideImage",
            "code": 3,
            "time": 0
        },
        {
            "type": "hideImage",
            "code": 4,
            "time": 0
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 1000
        },
        {
            "type": "playBgm",
            "name": "piaobo.mp3",
            "keep": true
        },
        "\t[塔露拉]老爷爷，根据我那点不怎么牢靠的记忆，是叫伊万·伊贾斯拉夫。",
        "\t[塔露拉]是个很常见的名字。他也是个随处可见的农民。",
        "\t[塔露拉]但他牺牲了自己。出于种种，他牺牲了自己的性命......",
        "\t[塔露拉]我偶尔会想，我是不是真的值得别人牺牲性命？",
        "\t[塔露拉]阿丽娜随我一起行动。这个人虽然大多时候都很柔和，有时候却突然地尖酸起来，让我感觉很不舒服。",
        "\t[塔露拉]计划顺利地推进着。",
        "\t[塔露拉]按照我的想法，很快，这一部分的感染者，一定会团结起来。",
        "\t[塔露拉]希望这确实有效。",
        "\t[塔露拉]也希望爷爷能够安眠。除了老奶奶，我没有比他更亲的亲人。",
        {
            "type": "showImage",
            "code": 2,
            "image": "iceforest.png",
            "loc": [
                -100,
                0
            ],
            "opacity": 1,
            "time": 1000
        },
        "2月7日",
        {
            "type": "showImage",
            "code": 3,
            "image": "tll.png",
            "loc": [
                -100,
                0
            ],
            "opacity": 1,
            "time": 500
        },
        {
            "type": "showImage",
            "code": 4,
            "image": "grz.png",
            "loc": [
                100,
                0
            ],
            "opacity": 1,
            "time": 500
        },
        "\t[塔露拉]先生，我是......",
        {
            "type": "showImage",
            "code": 3,
            "image": "tlla.png",
            "loc": [
                -100,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        "\t[感染者]你这身衣服，你是哪的军官老爷？你来是要杀我吗？那你就杀吧！你们这些天杀的恶鬼！",
        "\t[塔露拉]\f[tll.png,-100,0]不，先生，我是来告诉你，纠察队今天会来这里，请先藏起来。",
        "\t[感染者]那让他们来吧，让他们杀了我们吧！",
        {
            "type": "hideImage",
            "code": 3,
            "time": 0
        },
        {
            "type": "showImage",
            "code": 4,
            "image": "grz.png",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 500
        },
        "\t[感染者]我们在这么偏的地方建了个几乎不能住人的村子，他们还要来！那就只能让他们来了！你们这种军官贵族，不论装成什么样！",
        "\t[感染者]你可能比他们好一点，因为你起码愿意和我说话——",
        "\t[感染者]嗯？人呢？",
        "\t[感染者]这又是什么骗局？哎，我们的命......",
        "\t[感染者]我们的命也就这种程度。",
        {
            "type": "hideImage",
            "code": 4,
            "time": 0
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "playSound",
            "name": "d_gen_walk_n.wav"
        },
        {
            "type": "showImage",
            "code": 4,
            "image": "jcd.png",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 1000
        },
        "\t[感染者纠察队]\f[jcd.png,0,0]对自己的命有认知也是好事。",
        {
            "type": "hideImage",
            "code": 4,
            "time": 0
        },
        {
            "type": "playBgm",
            "name": "buan.mp3",
            "keep": true
        },
        "\t[感染者]\f[grz.png,0,0]啊......纠察队老爷......",
        "\t[感染者纠察队]\f[jcd.png,0,0]......又穷又破。体格也很差。送军队矿场去也没什么油水赚。",
        "\t[感染者纠察队]\f[jcd.png,0,0]你是要怎么个死法？痛快的还是慢慢的？\t感染者比驮兽还不如。驮兽还能装运货物，你们活着只是浪费陛下的土地！",
        {
            "type": "showImage",
            "code": 4,
            "image": "tll.png",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 1000
        },
        "\t[塔露拉]\f[tll.png,0,0]为什么？",
        {
            "type": "hideImage",
            "code": 4,
            "time": 0
        },
        "\t[感染者纠察队]\f[jcd.png,0,0]——",
        "\t[感染者纠察队]\f[jcd.png,0,0]你是哪来的？",
        "\t[感染者纠察队]\f[jcd.png,0,0]......你，你也是感染者？",
        "\t[塔露拉]\f[tll.png,0,0]是",
        "\t[塔露拉]\f[tll.png,0,0]但我们感染者有生有死，这生死为什么要你来定？",
        "\t[塔露拉]\f[tll.png,0,0]感染者兄弟，抬起头来看看他的眼神，他的嘴，他的笑！他想决定我们怎么死，可凭什么？难道他就比我们价值更高？",
        "\t[感染者纠察队]\f[jcd.png,0,0]你！",
        "\t[塔露拉]\f[tll.png,0,0]你们不是害怕感染者造成什么危害。不。你这辈子连有威胁的感染者都没见过几个。",
        "\t[塔露拉]\f[tll.png,0,0]你们只是想利用我们的命，只是想玩弄我们的性命！",
        "\t[感染者]\f[grz.png,0,0]啊......！",
        "\t[塔露拉]\f[tll.png,0,0]在他们以前的暴行里，他们有因为谁态度好就放过谁吗，有因为别人做得对就让他们活吗？没有！我们感染者，怎么活，怎么死，只该我们自己决定！",
        "\t[感染者]\f[grz.png,0,0]......！你......究竟是谁？",
        "\t[感染者纠察队]\f[jcd.png,0,0]混账东西！你叫什么名字......",
        "\t[感染者纠察队]\f[jcd.png,0,0]以皇帝的名义！居然用这些歪理邪说蛊惑他的子民，我们这就处死你！",
        "\t[塔露拉]\f[tll.png,0,0]对于我的同胞，我的名字没有意义。如果一定要叫名字，你们可以叫我塔露拉。",
        "\t[塔露拉]\f[tll.png,0,0]至于我的敌人，你们不需要知道我的名字，因为——",
        "\t[塔露拉]\f[tllf.png,0,0]\r[red]\\c[25]我的火会点燃你们",
        {
            "type": "changeFloor",
            "floorId": "MT17",
            "loc": [
                6,
                10
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [30136,30137,30138,30139,60104,60105,60106,60107,60108,  0,  0,  0,  0],
    [30144,30145,30146,30147,60112,60113,60114,60115,60116,20024,30141,30142,30143],
    [30152,30153,30154,30155,60120,60121,60122,60123,60124,30148,30149,30150,30151],
    [30160,30161,30162,30163,60128,60129,60130,60131,60132,30156,30157,30158,30159],
    [30168,30169,30170,30171,60136,60137,60138,60139,60140,30164,30165,30166,30167],
    [  0,  0,  0,  0,  0,20030,  0,30017,  0,30172,30173,30174,30175],
    [  0,  0,20024,  0,  0,20006,  0,20006,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,20014,  0,20014,30136,30137,30138,30139,  0],
    [  0,30140,30141,30142,20028,  0,  0,  0,30144,30145,30146,30147,20024],
    [  0,30148,30149,30150,30151,  0,  0,20028,30152,30153,30154,30155,  0],
    [  0,30156,30157,30158,30159,20028,342,20024,30160,30161,30162,30163,  0],
    [  0,30164,30165,30166,30167,20020,  0,20021,20022,30169,30170,30171,  0],
    [  0,30172,30173,30174,30175,20006,  0,  0,  0,20019,20020,  0,  0]
],
    "bgmap": [
    [20012,  0,  0,20016,20032,20004,  0,  0,  0,  0,20025,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,20016,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,20004,  0,  0,  0,  0,  0,20012,  0,  0,  0],
    [20012,  0,  0,20017,  0,  0,20016,  0,  0,20032,  0,20025,  0],
    [  0,20032,  0,  0,20004,  0,  0,  0,  0,  0,  0,  0,20012],
    [  0,  0,  0,  0,  0,  0,  0,  0,20028,  0,  0,  0,  0],
    [20025,  0,  0,  0,20006,20016,  0,  0,20006,  0,  0,  0,20017],
    [  0,  0,  0,  0,20014,  0,  0,  0,20014,  0,  0,  0,  0],
    [  0,20025,  0,  0,20019,  0,  0,  0,30168,  0,  0,20025,  0],
    [20017,  0,  0,  0,20012,  0,  0,20016,20004,  0,  0,  0,20032]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,103,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "weather": [
        "snow",
        8
    ],
    "beforeBattle": {},
    "cannotMoveIn": {}
}