main.floors.MT17=
{
    "floorId": "MT17",
    "title": "",
    "name": "西北冻原",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X20000",
    "bgm": "bg.mp3",
    "firstArrive": [
        {
            "type": "hideImage",
            "code": 1,
            "time": 0
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 500
        },
        {
            "type": "moveHero",
            "time": 1000,
            "steps": [
                "up:1"
            ]
        },
        {
            "type": "setBlock",
            "number": "A336",
            "loc": [
                [
                    7,
                    9
                ]
            ]
        },
        {
            "type": "playSound",
            "name": "118-Fire02.ogg"
        },
        "\t[感染者纠察队]\f[jcd.png:x,100,0]这是....源石技艺？",
        {
            "type": "moveHero",
            "time": 1000,
            "steps": [
                "up:1"
            ]
        },
        {
            "type": "setBlock",
            "number": "A336",
            "loc": [
                [
                    5,
                    7
                ]
            ]
        },
        {
            "type": "playSound",
            "name": "Fire1.ogg"
        },
        "\t[塔露拉]\f[tll.png,-100,0]现在，是我决定你的死法",
        {
            "type": "move",
            "loc": [
                6,
                6
            ],
            "time": 1000,
            "keep": true,
            "steps": [
                "up:1"
            ]
        },
        "\t[感染者纠察队]\f[jcd.png:x,100,0]...你...你只是虚张声势罢了",
        {
            "type": "moveHero",
            "time": 1000,
            "steps": [
                "up:1"
            ]
        },
        "\t[塔露拉]\f[tll.png,-100,0]啊...让我想想",
        {
            "type": "callSave"
        },
        {
            "type": "choices",
            "text": "\t[塔露拉]那么我就",
            "choices": [
                {
                    "text": "用火烧死你罢（升级德拉克之火）",
                    "action": [
                        {
                            "type": "playSound",
                            "name": "Fire1.ogg"
                        },
                        {
                            "type": "animate",
                            "name": "fire",
                            "loc": [
                                6,
                                5
                            ]
                        },
                        {
                            "type": "showImage",
                            "code": 1,
                            "image": "dark.png",
                            "loc": [
                                0,
                                0
                            ],
                            "opacity": 1,
                            "time": 0
                        },
                        "\t[感染者纠察队]\r[red]啊啊啊啊啊！",
                        {
                            "type": "setValue",
                            "name": "flag:t1",
                            "value": "1"
                        },
                        "\t[塔露拉]这是你应得的下场",
                        {
                            "type": "showImage",
                            "code": 2,
                            "image": "ts1.png",
                            "loc": [
                                0,
                                160
                            ],
                            "opacity": 1,
                            "time": 1000
                        },
                        "\t[塔露拉]——",
                        {
                            "type": "playSound",
                            "name": "levelup.wav"
                        },
                        {
                            "type": "showImage",
                            "code": 2,
                            "image": "ts11.png",
                            "loc": [
                                0,
                                160
                            ],
                            "opacity": 1,
                            "time": 0
                        }
                    ]
                },
                {
                    "text": "用火刃烧死你罢（升级日冕戮刃）",
                    "action": [
                        {
                            "type": "playSound",
                            "name": "118-Fire02.ogg"
                        },
                        {
                            "type": "animate",
                            "name": "swordr",
                            "loc": [
                                6,
                                5
                            ]
                        },
                        {
                            "type": "showImage",
                            "code": 1,
                            "image": "dark.png",
                            "loc": [
                                0,
                                0
                            ],
                            "opacity": 1,
                            "time": 0
                        },
                        "\t[感染者纠察队]啊啊啊啊啊！",
                        {
                            "type": "setValue",
                            "name": "flag:t2",
                            "value": "1"
                        },
                        "\t[塔露拉]这是你应得的下场",
                        {
                            "type": "showImage",
                            "code": 2,
                            "image": "ts2.png",
                            "loc": [
                                0,
                                160
                            ],
                            "opacity": 1,
                            "time": 1000
                        },
                        "\t[塔露拉]——",
                        {
                            "type": "playSound",
                            "name": "levelup.wav"
                        },
                        {
                            "type": "showImage",
                            "code": 2,
                            "image": "ts21.png",
                            "loc": [
                                0,
                                160
                            ],
                            "opacity": 1,
                            "time": 0
                        }
                    ]
                }
            ]
        },
        "\t[塔露拉]......看来我对火焰的掌握越来越熟练了。",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    5
                ]
            ],
            "remove": true
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 500
        },
        {
            "type": "hideImage",
            "code": 1,
            "time": 500
        },
        {
            "type": "pauseBgm"
        },
        "\t[塔露拉]\f[tll.png,-100,0]那么，这位同胞，你要加入我吗？",
        "\t[感染者]\f[grz.png,100,0]......",
        {
            "type": "showImage",
            "code": 1,
            "image": "dark.png",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        "\t[感染者]\f[grz.png,0,0]我和我同胞的命就拜托你了",
        {
            "type": "changeFloor",
            "floorId": "MT18",
            "loc": [
                5,
                8
            ],
            "direction": "up"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,6": {
            "trigger": null,
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "data": []
        },
        "6,5": {
            "trigger": null,
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "data": []
        }
    },
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,30140,30141,30142,30143,  0,  0,30164,30165,30166],
    [  0,30140,30141,30142,30143,30149,30150,30151,  0,  0,  0,30173,30174],
    [  0,30148,30149,30150,30151,30157,30158,30159,  0,  0,  0,30140,30141],
    [  0,  0,  0,  0,30164,30165,30166,30167,  0,  0,  0,30148,30149],
    [  0,20077,20078,20079,  0,20109,20110,30140,30141,30142,30143,  0,30157],
    [20084,20085,20086,20087,  0,  0,  0,30148,30149,30150,30151,30151,30165],
    [20092,20093,20094,20095,  0,  0,330,30156,30157,30158,30159,30159,30173],
    [20100,20101,20102,20103,  0,  0,  0,30164,30165,30166,30167,30167,  0],
    [20108,20109,20110,20111,  0,  0,  0,30172,30173,30174,30175,30175,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,30140,30141,30142,30143,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,30148,30149,30150,30151,  0,  0]
],
    "bgmap": [
    [30156,30157,30158,30159,  0,  0,  0,30148,30149,30150,30151,  0,  0],
    [30164,30165,30166,30167,30143,  0,  0,30156,30157,30158,30159,  0,  0],
    [30172,30173,30174,30175,30151,  0,  0,30164,30165,30166,30167,  0,  0],
    [  0,30156,30157,30158,30159,  0,  0,30140,30173,30174,  0,  0,  0],
    [  0,30164,30165,30166,30167,  0,  0,30172,  0,  0,  0,  0,  0],
    [30172,30172,30173,30174,30175,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,30140,30141,30142,30143,  0,  0,  0,  0,30140,30141],
    [  0,  0,  0,30148,30149,  0,  0,  0,  0,  0,  0,30148,30149],
    [  0,  0,  0,30156,30157,30158,  0,  0,  0,  0,  0,30156,30157],
    [  0,  0,  0,30164,30165,30166,  0,  0,  0,  0,  0,30164,30165],
    [  0,  0,  0,30172,30173,30174,  0,  0,  0,  0,  0,30172,30173],
    [  0,  0,30167,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,30148,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,30156,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,30140,30141,30142,30143],
    [  0,  0,  0,  0,  0,30143,30143,  0,  0,30148,30149,30150,30151],
    [  0,  0,  0,  0,  0,30150,30151,  0,  0,30156,30157,30158,30159],
    [30141,30142,30140,  0,  0,  0,30159,  0,  0,30164,30165,30166,30167],
    [30149,30150,30151,  0,  0,  0,30167,  0,  0,30172,30173,30174,30175],
    [30157,30158,30159,30141,30142,30140,30175,  0,  0,30140,30141,30142,30173],
    [30165,30166,30148,30149,30150,30151,  0,  0,  0,30148,30149,30150,30151],
    [30173,30174,30156,30157,30158,30159,  0,  0,  0,30156,30157,30158,30159]
],
    "weather": [
        "snow",
        8
    ],
    "beforeBattle": {},
    "cannotMoveIn": {}
}