main.floors.MT19=
{
    "floorId": "MT19",
    "title": "",
    "name": "西北冻原",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2,
    "defaultGround": "X80046",
    "bgm": "bg.mp3",
    "firstArrive": [
        {
            "type": "playBgm",
            "name": "piaobo.mp3",
            "keep": true
        },
        {
            "type": "showImage",
            "code": 1,
            "image": "dust.png",
            "loc": [
                -150,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        "\t[塔露拉]\f[tll.png,0,0]没错，是这里",
        "\t[塔露拉]\f[tll.png,0,0]那些纠察队就是在这座废弃城市里新设了哨站。黑衣黑甲的毒虫子......啃食庄稼，连根都不给我们剩下。",
        "\t[塔露拉]\f[tll.png,0,0]......这座城大概被废弃了有十几年了。",
        "\t[塔露拉]\f[tll.png,0,0]核心设备被拉走，居民也一个不剩，留下的这些建筑和地块不知什么时候也会被拆得干干净净。",
        {
            "type": "showImage",
            "code": 2,
            "image": "tlla.png",
            "loc": [
                -100,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        {
            "type": "showImage",
            "code": 3,
            "image": "grzzsa.png",
            "reverse": ":x",
            "loc": [
                100,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        "\t[感染者战士]\f[grzzs.png:x,100,0]这原本又是哪个贵族老爷的领地？",
        "\t[塔露拉]\f[tll.png,-100,0]涅瓦山男爵，乱刀刺死。数百里内所有能继承他遗产的人也都被连根拔除了。",
        "\t[感染者战士]\f[grzzs.png:x,100,0]谁做的？够狠的。",
        "\t[塔露拉]\f[tll.png,-100,0]保皇党。第一集团军里有不少这种人。",
        "\t[感染者战士]\f[grzzs.png:x,100,0]我不明白了，塔露拉，前几天你不是说，大叛乱是现在的皇帝和当兵的贵族老爷们干起来了吗？",
        "\t[感染者战士]\f[grzzs.png:x,100,0]那为什么会有部队帮着皇帝杀贵族？",
        "\t[塔露拉]\f[tll.png,-100,0]大叛乱时期主导叛乱的，正是在上一个时代......那个乌萨斯不断对外扩张的时代里，占尽好处的贵族将领们。",
        "\t[塔露拉]\f[tll.png,-100,0]新皇登基了以后，自然要让这些人把他们吞进去的资源和城市、居民都吐出来。",
        "\t[塔露拉]\f[tll.png,-100,0]当时，乌萨斯的军队大多处在贵族将领的控制之下，但是保皇党也很聪明，少一张嘴多一份钱。",
        "\t[塔露拉]\f[tll.png,-100,0]杀了那些贵族，钱就进了自己的口袋，虽然风险很大，他们却也还算有冒险的资本。",
        "\t[塔露拉]\f[tll.png,-100,0]所以大叛乱时期，除了明哲保身的各大城市，举兵叛乱的家族遭受的最严重的打击，可能都是保皇党一手促成的。",
        "\t[塔露拉]\f[tll.png,-100,0]这么说。如果是叛军在大叛乱里取得了战争的优势。",
        "\t[塔露拉]\f[tll.png,-100,0]那结果只可能是保皇党被吊死，皇帝被软禁，被迫同意军队里这些浑身冒着酸臭气味的老贵族的特权。",
        "\t[塔露拉]\f[tll.png,-100,0]各个大公和诸集团军会把乌萨斯分割成好几块分别统治，至少暗地里肯定这么来。",
        "\t[塔露拉]\f[tll.png,-100,0]而且，现实地说，在大叛乱中和事情结束后节节高升的青年军官，可别以为他们都是向着新皇帝。他们可能只是向着钱。",
        "\t[感染者战士]\f[grzzs.png:x,100,0]......懂了。说到底还是为了钱打仗。",
        "\t[塔露拉]\f[tll.png,-100,0]没错。",
        "\t[感染者战士]\f[grzzs.png:x,100,0]哈，你是什么事儿都答得上来吗，塔露拉？",
        "\t[塔露拉]\f[tll.png,-100,0]......教我这些东西的人傲慢到根本不在乎我学了多少。我知道的那些，随口说出来肯定还是可以的。",
        "\t[感染者战士]\f[grzzs.png:x,100,0]得了吧，你可真够聪明的。来这是为了什么？你都说了，能住人的地方早都没了。",
        "\t[感染者战士]\f[grzzs.png:x,100,0]你这几天是怎么从那些人的疯话里听出来......听出来纠察队在这里的？",
        "\t[塔露拉]\f[tll.png,-100,0]周边的各个村庄都打算迁移，如果不是天灾要来了，那就只有一个原因",
        "\t[塔露拉]\f[tll.png,-100,0]是这些腐败的纠察队进驻了。可这要是某支部队经过，村庄是不敢走的。",
        "\t[塔露拉]\f[tll.png,-100,0]大概是因为收获季刚过吧。纠察队挑这个时候进行例行搜查，不过是看准了税吏还没进村。",
        "\t[塔露拉]\f[tll.png,-100,0]最近的还在运作的城市，舒拉茨堡，是个轻工业为主的城市，停靠在这里最多只是想要采购资源。",
        "\t[塔露拉]\f[tll.png,-100,0]附近几个村庄大多没有地主保护，腐败的纠察队千里迢迢赶到这里，一定是看中了有油水可捞。",
        "\t[塔露拉]\f[tll.png,-100,0]......原本只是在大叛乱之后组织起来搜捕感染者的流氓，现在都成了横行乡野无恶不作的老爷了。",
        "\t[感染者战士]\f[grzzs.png:x,100,0]那是得打掉他们。我们在附近过的这段日子会安生很多。该打。",
        "\t[塔露拉]\f[tll.png,-100,0]我们没那个本事。",
        "\t[感染者战士]\f[grzzs.png:x,100,0]啊？那我们在这是要干什么？",
        "\t[塔露拉]\f[tll.png,-100,0]......游击队。",
        "\t[感染者战士]\f[grzzs.png:x,100,0]......游击队？",
        "\t[塔露拉]\f[tll.png,-100,0]是的。",
        "\t[感染者战士]\f[grzzs.png:x,100,0]感染者的游击队？！那可是......皇帝在上......",
        "\t[塔露拉]\f[tll.png,-100,0]想联络上他们并不容易，我们追了三个月的消息，现在总算捞到了机会。",
        "\t[感染者战士]\f[grzzs.png:x,100,0]但，这，你联系上南方城市里的感染者都很轻松，想联系上他们倒真有这么难？",
        "\t[塔露拉]\f[tll.png,-100,0]一支军队想在城市中生存，靠的是不休的交流和情报，但想在雪原上生存，需要靠不被乌萨斯侦查部队发现的战术和作息。",
        "\t[塔露拉]\f[tll.png,-100,0]感染者也有不少信使，还有自己传达信号的方式和渠道。",
        "\t[塔露拉]\f[tll.png,-100,0]游击队呢？游击队只和冻原上的感染者对话。他们排外，他们不想被人找到，也不想和谁团结起来。",
        "\t[塔露拉]\f[tll.png,-100,0] 它只是不断接纳感染者，把他们训练成战士。确保新鲜的血液能够流淌，生机勃勃。",
        "\t[塔露拉]\f[tll.png,-100,0]当地的感染者不会说有游击队来过，但村外头的生火痕迹可不会是军队留下的。",
        "\t[塔露拉]\f[tll.png,-100,0]他们要做的只会是这件事：毁了这个刚建立起来的哨所和纠察队。",
        "\t[塔露拉]\f[tll.png,-100,0]各位，就在这里等吧。注意警戒，也许会有纠察官从这里逃跑。",
        "\t[塔露拉]\f[tll.png,-100,0]这儿离舒拉茨堡市还很远，哨站也没建设牢固，他们一定会撤退，如果他们没被游击队全歼的话。",
        "\t[塔露拉]\f[tll.png,-100,0]藏好。我们向来不会正面和两三个小队的纠察队起冲突。",
        {
            "type": "hideImage",
            "code": 2,
            "time": 0
        },
        {
            "type": "hideImage",
            "code": 3,
            "time": 0
        },
        "\t[感染者战士]\f[grzzs.png,0,0]塔露拉？！你要一个人去？",
        "\t[塔露拉]\f[tll.png,0,0]就让我一个人去吧。要和游击队联络，得向游击队展示，我们没敌意。",
        "\t[塔露拉]\f[tll.png,0,0]还有，起了冲突的话，你们也能逃得掉。",
        "\t[感染者战士]\f[grzzs.png,0,0]你当我们是懦夫？！",
        "\t[塔露拉]\f[tll.png,0,0]我没见过比你们更勇敢的人了。所以对其他的感染者同胞来说，你们很重要，他们想要活得更久，就更需要你们。",
        "\t[塔露拉]\f[tll.png,0,0]你们活着，和因为我而牺牲更多人相比，哪个好？结果很明显了。",
        "\t[感染者战士]\f[grzzs.png,0,0]——",
        "\t[感染者战士]\f[grzzs.png,0,0]你还是瞧不起我们。",
        "\t[塔露拉]\f[tll.png,0,0]这是我想了很久得出来的结论，而且，这是对所有人都最好的那个结果。",
        "\t[塔露拉]\f[tll.png,0,0]你可别乱说话。",
        "\t[感染者战士]\f[grzzs.png,0,0]你生气了！",
        "\t[感染者战士]\f[grzzs.png,0,0]可我们也一样火气很大！你觉得我们不懂你，就像我们觉着你没搞懂我们在想什么一样。",
        "\t[感染者战士]\f[grzzs.png,0,0]我们几个不想要结论。我们和你一起从西北往回走......不是为了啥结论。",
        "\t[感染者战士]\f[grzzs.png,0,0]你打得好！你让大家吃上了饭，你让我们知道了很多事儿。",
        "\t[感染者战士]\f[grzzs.png,0,0]虽然不怎么懂，但我觉得你和那些其他城里来的，甚至是矿场里那些感染者是不一样的。",
        "\t[感染者战士]\f[grzzs.png,0,0]你只是不想让我们死对吧？塔露拉，你看我们怕吗？我们不是懦夫！",
        "\t[感染者战士]\f[grzzs.png,0,0]你肯定没想过，我们比起苟且偷生，更愿意陪着你一块儿死！",
        "\t[塔露拉]\f[tll.png,0,0]如果我说我早就想到了，只不过就是不希望你们这么做呢？",
        "\t[感染者战士]\f[grzzs.png,0,0]为什么？",
        "\t[塔露拉]\f[tll.png,0,0]因为我不会死。",
        "\t[塔露拉]\f[tll.png,0,0]放心吧，让我去。你们不去也是减少伤亡。我可是，哈，“不死的”。",
        "\t[塔露拉]\f[tll.png,0,0]那个恶心的老怪物是这么对我说的。",
        "\t[感染者战士]\f[grzzs.png,0,0]但......塔露拉，我们可不该被别人看低！别让他们觉得我们是在求他们，让我们跟你一起吧！",
        "\t[塔露拉]\f[tll.png,0,0]不对！",
        "\t[塔露拉]\f[tll.png,0,0]刽子手才讲究谁更会杀人。你们已经赢得很多人的尊敬了，因为你们站了出来。",
        "\t[塔露拉]\f[tll.png,0,0]如果谁看低你们，那该被鄙夷的就是他们。",
        "\t[感染者战士]\f[grzzs.png,0,0]......行",
        "\t[感染者战士]\f[grzzs.png,0,0]——等等，塔露拉！你真的只带一把剑去吗！",
        "\t[塔露拉]\f[tll.png,0,0]我还带了名册和频道号码簿！",
        "\t[塔露拉]\f[tll.png,0,0]朋友们，记住！这可比剑重要得多！",
        {
            "type": "pauseBgm"
        },
        {
            "type": "hideImage",
            "code": 1,
            "time": 1000
        },
        "\t[塔露拉]\f[tll.png,-100,0]看来驻守在这个地区的不止是纠察队，还有相当部分的...军队？",
        "\t[塔露拉]\f[tll.png,-100,0]不，这只是...在效仿乌萨斯军队。",
        "\t[塔露拉]\f[tll.png,-100,0]即便如此，还是相同制式的装备吗......",
        "\t[塔露拉]\f[tll.png,-100,0]真是棘手......",
        "\t[塔露拉]\f[tll.png,-100,0]等等，这些冰晶是什么？",
        "随着塔露拉的成长，源石与血瓶的加成变为原本的二倍。",
        {
            "type": "playBgm",
            "name": "mosheng.mp3",
            "keep": true
        },
        {
            "type": "setValue",
            "name": "flag:bgm",
            "value": "2"
        },
        {
            "type": "if",
            "condition": "(flag:h<=2)",
            "true": [
                {
                    "type": "setValue",
                    "name": "status:mana",
                    "operator": "+=",
                    "value": "100"
                },
                {
                    "type": "setValue",
                    "name": "item:yellowKey",
                    "operator": "+=",
                    "value": "3"
                },
                {
                    "type": "setValue",
                    "name": "item:blueKey",
                    "operator": "+=",
                    "value": "1"
                }
            ]
        },
        {
            "type": "if",
            "condition": "(flag:h<=1)",
            "true": [
                {
                    "type": "setValue",
                    "name": "status:mana",
                    "operator": "+=",
                    "value": "200"
                },
                {
                    "type": "setValue",
                    "name": "item:yellowKey",
                    "operator": "+=",
                    "value": "3"
                },
                {
                    "type": "setValue",
                    "name": "item:blueKey",
                    "operator": "+=",
                    "value": "2"
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            3,
                            11
                        ]
                    ],
                    "floorId": "MT20",
                    "remove": true
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,6": {
            "trigger": "action",
            "enable": true,
            "noPass": true,
            "displayDamage": true,
            "data": [
                "\t[塔露拉]还是不攻击这些帮助我的冰晶为好。"
            ]
        }
    },
    "changeFloor": {
        "6,1": {
            "floorId": "MT20",
            "loc": [
                9,
                12
            ]
        }
    },
    "afterBattle": {
        "5,6": [
            "\t[塔露拉]\f[tll.png,0,0]原来如此，这些冰晶攻击范围内的敌人的实力都遭到了削弱......",
            "\t[塔露拉]\f[tll.png,0,0]但是为什么？我记得“盾”里面没有这等人物......",
            "\t[塔露拉]\f[tll.png,0,0]目前这些冰晶不会攻击我，我还是不攻击冰晶为好。"
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [80129,80129,80193,80129,80129,80133,80134,80135,80129,80129,80175,80129,80129],
    [80200,80200,80201,80201,80200,80141, 91,80143,80201,80200,80183,80201,80200],
    [  0, 27,80144, 30,80007,  0,330,  0, 31,  0, 81,80007, 33],
    [ 29, 31,80144, 32,246,  0,  0, 34,80007,330,  0, 30, 81],
    [  0,80193,80129,80129,80194, 31,80197,80129,80130,  0, 30,  0,  0],
    [246,80137,80144,80137,80161, 81,80137,80137,80138, 81,80007,231,80129],
    [ 81, 32,80144, 21, 29,330,  0,388,80146,246, 22, 21,80137],
    [80007, 31,80144, 27,80007,  0,80007,  0,80146, 28, 32, 31, 27],
    [332, 32,80152,80193,80194,  0, 32,80196,80192,80133,332,80135,80192],
    [ 81,80197,80201,80201,80202,332,80203,80201,80200,80141, 82,80143,80200],
    [  0, 31,  0, 33, 21, 31, 21, 33,  0, 31,  0, 81, 30],
    [80192,80193,80192,80193,80192,80193,80194,  0,80196,80197,80192,80192,80193],
    [80201,80201,80200,80201,80200,80201,80202,80203,80204,80205,80200,80200,80201]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,80129,  0,  0,80014,  0,143,  0,  0,  0,  0,  0],
    [  0,  0,80137,  0,  0,80153,143,143,143,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,143,143,143,143,143,  0,  0,  0],
    [  0,  0,  0,  0,  0,80014,143,143,143,  0,  0,  0,  0],
    [  0,  0,  0,  0,80007,  0,  0,80007,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,80014,  0,  0,  0,  0,80014,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,80128,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,80144,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [80134,  0,80128,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80134,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "weather": [
        "snow",
        5
    ],
    "beforeBattle": {},
    "cannotMoveIn": {}
}