main.floors.MT21=
{
    "floorId": "MT21",
    "title": "西北冻原",
    "name": "西北冻原",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2,
    "defaultGround": "X80046",
    "bgm": "bg.mp3",
    "firstArrive": [
        {
            "type": "animate",
            "name": "jy",
            "loc": [
                8,
                11
            ]
        },
        {
            "type": "move",
            "loc": [
                8,
                11
            ],
            "time": 1000,
            "keep": true,
            "steps": [
                "left"
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "8,9": {
            "trigger": "action",
            "enable": true,
            "noPass": true,
            "displayDamage": true,
            "data": [
                "\t[塔露拉]还是不攻击这些帮助我的冰晶为好。"
            ]
        },
        "3,6": {
            "trigger": "action",
            "enable": true,
            "noPass": true,
            "displayDamage": true,
            "data": [
                "\t[塔露拉]还是不攻击这些帮助我的冰晶为好。"
            ]
        },
        "10,2": {
            "trigger": null,
            "enable": true,
            "noPass": true,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                {
                    "type": "pauseBgm"
                },
                "残缺的石碑上写着并不是十分清晰的字体",
                "人类的欲望是无穷的",
                "即便是所谓的无欲之人，最终也会被欲望所吞噬。",
                "这就是人类。",
                {
                    "type": "setValue",
                    "name": "flag:j2",
                    "value": "1"
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            10,
                            3
                        ]
                    ],
                    "remove": true
                },
                {
                    "type": "choices",
                    "text": "\t[记忆装置,I335]发现记忆碎片\r[gray]“无欲之人”\r，是否查看？",
                    "choices": [
                        {
                            "text": "是",
                            "action": [
                                {
                                    "type": "pauseBgm"
                                },
                                {
                                    "type": "playBgm",
                                    "name": "kuchu.mp3",
                                    "keep": true
                                },
                                {
                                    "type": "showImage",
                                    "code": 1,
                                    "image": "dark.png",
                                    "loc": [
                                        0,
                                        0
                                    ],
                                    "opacity": 1,
                                    "time": 500
                                },
                                "泰拉673年",
                                "\t[未知人物]我一直认为自己是一个无欲的人。",
                                "\t[未知人物]我活着如同驮兽一般",
                                {
                                    "type": "showImage",
                                    "code": 2,
                                    "image": "country.png",
                                    "loc": [
                                        0,
                                        0
                                    ],
                                    "opacity": 1,
                                    "time": 500
                                },
                                "\t[未知人物]我出生于一个普通的农民家庭。",
                                "\t[未知人物]在我十岁的那年，我的父亲，意外变成了一个源石病患者，而之后，他很快的死去了。",
                                "\t[未知人物]我理所应当的，也感染了源石病。",
                                "\t[未知人物]源石在我的体内生长，我貌似在这源石技艺方面有十分不错的天赋，我逐渐可以使用一些法术，起初我尝试用它来帮助他人。",
                                "\t[未知人物]而这却让我招来了附近居民的唾骂。",
                                "\t[未知人物]我当时根本就不懂，源石病是什么，我只知道它害死了我的父亲。",
                                "\t[未知人物]他们对待我如同对待最下等的驮兽一般，如同瘟神一样避我而去。",
                                "\t[未知人物]我不懂，我没做错任何事情，我只是存在于这个世界上，难道我的存在便是一个错误吗？",
                                "\t[未知人物]我无法与人沟通，我也逐渐不喜欢与他人沟通。",
                                {
                                    "type": "showImage",
                                    "code": 2,
                                    "image": "forest.png",
                                    "loc": [
                                        0,
                                        0
                                    ],
                                    "opacity": 1,
                                    "time": 500
                                },
                                "\t[未知人物]在监狱的牢房中，四处都充满着阴暗与潮湿的气息。",
                                "\t[未知人物]我被人诬陷偷了一个贵族的衣服，以此来顶替衙役没有抓到的那个大盗，给贵族一个交代。",
                                "\t[未知人物]我开始思考我生而为人的意义，没有结果。",
                                "\t[未知人物]讽刺的是，身为源石病患者的我，却貌似有着先天的抗体，我还能再活很久，但是作为人存在的意义而言，我已经无法找到活下去的意义。",
                                "\t[未知人物]直到有一个人找到了我。",
                                {
                                    "type": "playSound",
                                    "name": "soldiers.wav"
                                },
                                {
                                    "type": "sleep",
                                    "time": 500
                                },
                                {
                                    "type": "playSound",
                                    "name": "door.wav"
                                },
                                "\t[未知人物α]把他放出来。",
                                "\t[未知人物]......",
                                "\t[未知人物α]你就是比利·布里杰？",
                                "\t[比利·布里杰]是我。",
                                "\t[未知人物α]去用你的法术制造混乱吧，你是天生的恶魔。",
                                "我此时非常激动，他竟然对我说，我是一个恶魔",
                                "恶魔、恶魔，我不是一个野兽，是一个有思考能力的生物",
                                "\t[比利·布里杰]我只是一个普通的人。",
                                "没错，我只是一个比垃圾还垃圾的感染者，生命无足轻重的感染者。",
                                "\t[未知人物α]足够了，为我的军队献上你的忠诚吧，你将成为最强大的源石术士。",
                                "源石术士?那些在军队中趾高气扬，地位颇高的源石术士？",
                                "\t[比利·布里杰]哈哈？",
                                "\t[比利·布里杰]哈哈哈哈哈哈哈！",
                                "一定是在监狱中关的太久，我已经不清醒了，我竟然产生了如此不切实际的幻觉。",
                                "\t[比利·布里杰]如果你说的是真的，军官大人，请告诉我，我凭什么？",
                                "\t[比利·布里杰]来啊！让我知道知道，我到底是有多大的能耐，可以被您看上？",
                                {
                                    "type": "hideImage",
                                    "code": 2,
                                    "time": 0
                                },
                                "自从感染源石病之后，我便会使用那令人作呕的源石技艺。",
                                "源石病是令人唾弃的，它产生的源石技艺自然也是。",
                                "我是令人唾弃的存在。",
                                "我昏了过去，隐约感觉自己被人带到了一个地方。",
                                "我的身边出现了一些军队的人，他们递给了我一支简陋的源石法杖。",
                                "\t[军队人员]现在，布里杰，试着对着前面的墙释放法术。",
                                {
                                    "type": "playSound",
                                    "name": "p_skill_blacktimewand_shot.wav"
                                },
                                "我放出了法术。",
                                {
                                    "type": "playSound",
                                    "name": "e_aoe_frostnovaice_h2.wav"
                                },
                                "墙壁应声倒塌。",
                                "\t[军队人员]测试通过，布里杰长官，请您前往军队报道。",
                                "原来，我始终都是清醒的。",
                                "\t[哀嚎的人]胳膊...我的胳膊！好疼...不要...不要过来！你这个恶魔！",
                                "而之后，杀人的快感逐渐让我开始明白了一件事。",
                                "\r[red]原来，我始终都渴望着杀人。",
                                {
                                    "type": "hideImage",
                                    "code": 1,
                                    "time": 0
                                }
                            ]
                        },
                        {
                            "text": "否",
                            "action": []
                        }
                    ]
                },
                {
                    "type": "playBgm",
                    "name": "mosheng.mp3",
                    "keep": true
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            10,
                            2
                        ]
                    ],
                    "remove": true
                }
            ]
        }
    },
    "changeFloor": {
        "8,12": {
            "floorId": "MT20",
            "loc": [
                5,
                1
            ]
        },
        "0,2": {
            "floorId": "MT22",
            "loc": [
                12,
                12
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [80128,80129,80129,80129,80129,80129,80129,80129,80129,80129,80129,80129,80130],
    [80144, 32,  0,80144, 33,80144,  0, 33,  0,80146,80118,80119,80146],
    [ 92,  0, 27,80144, 34,80144, 32,  0, 32,80146, 90,80127,80146],
    [80144,80007, 21,80170, 82,80155,246,80007,  0,80146, 91, 28,80146],
    [80144,  0, 29,80144, 28,  0, 29,80140, 81,80154, 31,  0,80146],
    [80170, 81,80129,80129,80129,80129,80129,80146, 29,  0,  0, 32,80146],
    [80144,246,  0,388,  0, 32, 27,80156, 81,80129,80129,80129,80146],
    [80144,  0,330,231, 31,  0,80012,80146,  0, 28, 21, 32,80146],
    [  0,80129, 81,80129,80140,80129,80129,80129,80129,80140,80129, 81,80146],
    [80144, 29, 32, 27,80146, 30,231, 30,388,80146,  0,332,80146],
    [80170,80129, 81,80129,80129,80129, 82,80129,80129,80129,80129, 81,80146],
    [80144, 21,332,  0, 21, 30, 21,  0,246, 27, 21, 28,80146],
    [80152,80129,80129,80129,80129,80129,80129,80129, 93,80129,80129,80129,80154]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80126,  0,  0],
    [  0,  0,  0,80156,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [80156,  0,  0,  0,  0,  0,  0,80130,  0,  0,  0,  0,  0],
    [  0,143,143,143,143,143,  0,80156,  0,  0,  0,  0,80130],
    [  0,  0,143,143,143,  0,  0,  0,143,  0,  0,  0,  0],
    [80156,  0,  0,  0,80129,  0,  0,  0,  0,80137,  0,  0,80155],
    [  0,  0,  0,  0,  0,  0,143,143,143,143,143,  0,  0],
    [80156,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80155],
    [  0,  0,  0,  0,  0,  0,  0,  0,143,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,80170,  0,80170,  0,  0,  0,80171,  0,  0,  0],
    [80170,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [80144,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,80171,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [80170,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,80134,  0,  0,  0,  0]
],
    "weather": [
        "snow",
        5
    ],
    "beforeBattle": {},
    "cannotMoveIn": {}
}