main.floors.MT23=
{
    "floorId": "MT23",
    "title": "西北冻原",
    "name": "西北冻原",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2,
    "defaultGround": "X80046",
    "bgm": "bg.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,9": {
            "trigger": null,
            "enable": true,
            "noPass": true,
            "displayDamage": true,
            "data": [
                "PRTS正在检测同步率",
                {
                    "type": "hide",
                    "loc": [
                        [
                            1,
                            3
                        ]
                    ],
                    "floorId": "MT22",
                    "time": 0
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            9,
                            3
                        ]
                    ],
                    "floorId": "MT22",
                    "time": 0
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            4,
                            8
                        ]
                    ],
                    "floorId": "MT22",
                    "time": 0
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            8,
                            8
                        ]
                    ],
                    "floorId": "MT22",
                    "time": 0
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            3,
                            6
                        ]
                    ],
                    "floorId": "MT21",
                    "time": 0
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            8,
                            9
                        ]
                    ],
                    "floorId": "MT21",
                    "time": 0
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            4,
                            7
                        ]
                    ],
                    "floorId": "MT20",
                    "time": 0
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            7,
                            6
                        ]
                    ],
                    "floorId": "MT19",
                    "time": 0
                },
                {
                    "type": "if",
                    "condition": "core.hasEnemyLeft(undefined,[\"MT19\",\"MT20\",\"MT21\",\"MT22\"]);",
                    "true": [
                        "同步率未达到100%，仍有敌人未清除",
                        {
                            "type": "show",
                            "loc": [
                                [
                                    1,
                                    3
                                ]
                            ],
                            "floorId": "MT22",
                            "time": 0
                        },
                        {
                            "type": "show",
                            "loc": [
                                [
                                    9,
                                    3
                                ]
                            ],
                            "floorId": "MT22",
                            "time": 0
                        },
                        {
                            "type": "show",
                            "loc": [
                                [
                                    4,
                                    8
                                ]
                            ],
                            "floorId": "MT22",
                            "time": 0
                        },
                        {
                            "type": "show",
                            "loc": [
                                [
                                    8,
                                    8
                                ]
                            ],
                            "floorId": "MT22",
                            "time": 0
                        },
                        {
                            "type": "show",
                            "loc": [
                                [
                                    3,
                                    6
                                ]
                            ],
                            "floorId": "MT21",
                            "time": 0
                        },
                        {
                            "type": "show",
                            "loc": [
                                [
                                    8,
                                    9
                                ]
                            ],
                            "floorId": "MT21",
                            "time": 0
                        },
                        {
                            "type": "show",
                            "loc": [
                                [
                                    4,
                                    7
                                ]
                            ],
                            "floorId": "MT20",
                            "time": 0
                        },
                        {
                            "type": "show",
                            "loc": [
                                [
                                    7,
                                    6
                                ]
                            ],
                            "floorId": "MT19",
                            "time": 0
                        }
                    ],
                    "false": [
                        "同步率已达到100%，继续前进吧",
                        {
                            "type": "show",
                            "loc": [
                                [
                                    1,
                                    3
                                ]
                            ],
                            "floorId": "MT22",
                            "time": 0
                        },
                        {
                            "type": "show",
                            "loc": [
                                [
                                    9,
                                    3
                                ]
                            ],
                            "floorId": "MT22",
                            "time": 0
                        },
                        {
                            "type": "show",
                            "loc": [
                                [
                                    4,
                                    8
                                ]
                            ],
                            "floorId": "MT22",
                            "time": 0
                        },
                        {
                            "type": "show",
                            "loc": [
                                [
                                    8,
                                    8
                                ]
                            ],
                            "floorId": "MT22",
                            "time": 0
                        },
                        {
                            "type": "show",
                            "loc": [
                                [
                                    3,
                                    6
                                ]
                            ],
                            "floorId": "MT21",
                            "time": 0
                        },
                        {
                            "type": "show",
                            "loc": [
                                [
                                    8,
                                    9
                                ]
                            ],
                            "floorId": "MT21",
                            "time": 0
                        },
                        {
                            "type": "show",
                            "loc": [
                                [
                                    4,
                                    7
                                ]
                            ],
                            "floorId": "MT20",
                            "time": 0
                        },
                        {
                            "type": "show",
                            "loc": [
                                [
                                    7,
                                    6
                                ]
                            ],
                            "floorId": "MT19",
                            "time": 0
                        },
                        {
                            "type": "hide",
                            "loc": [
                                [
                                    6,
                                    9
                                ]
                            ],
                            "remove": true
                        }
                    ]
                }
            ]
        },
        "6,8": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                {
                    "type": "pauseBgm"
                },
                {
                    "type": "playBgm",
                    "name": "buan.mp3",
                    "keep": true
                },
                "\t[落单的感染者战士A]\f[child.png,100,0]可恶......和大家分开了......",
                "\t[感染者纠察队]\f[jcd.png,-100,0]哼......可算让我抓到了两个落单的了",
                "\t[感染者纠察队]\f[jcd.png,-100,0]这个感染者队伍简直不可理喻，特别是为首的那个人还有她的冰晶......真是可怕",
                "\t[感染者纠察队]\f[jcd.png,-100,0]但是，我不能空着手回去，太丢人了......",
                "\t[感染者纠察队]\f[jcd.png,-100,0]至少也要抓几个回去......",
                {
                    "type": "move",
                    "loc": [
                        6,
                        8
                    ],
                    "time": 500,
                    "keep": true,
                    "steps": [
                        "up",
                        "up"
                    ]
                },
                {
                    "type": "move",
                    "loc": [
                        7,
                        5
                    ],
                    "time": 300,
                    "keep": true,
                    "steps": [
                        "left"
                    ]
                },
                "\t[落单的感染者战士B]\f[child.png,100,0]你......你别过来！",
                "\t[塔露拉]\f[tllf.png,100,0]切！",
                "\t[塔露拉]\f[tllf.png,100,0]住手！",
                {
                    "type": "moveHero",
                    "time": 300,
                    "steps": [
                        "up",
                        "up"
                    ]
                },
                "\t[感染者纠察队]\f[jcd.png,-100,0]什么？",
                {
                    "type": "animate",
                    "name": "2",
                    "loc": "hero"
                },
                {
                    "type": "pauseBgm"
                },
                {
                    "type": "move",
                    "loc": [
                        6,
                        6
                    ],
                    "time": 1000,
                    "keep": true,
                    "steps": [
                        "right"
                    ]
                },
                {
                    "type": "playSound",
                    "name": "fall.wav"
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            7,
                            6
                        ]
                    ],
                    "remove": true,
                    "time": 0
                },
                {
                    "type": "sleep",
                    "time": 1000
                },
                "\t[落单的感染者战士A]\f[child.png,100,0]得...得救了？",
                "\t[落单的感染者战士B]\f[child.png,100,0]这个衣服......你也是那些贵族？但为什么......",
                "\t[塔露拉]\f[tll.png,100,0]你们应该就是感染者口中的......雪怪小队吧。",
                "\t[塔露拉]\f[tllf.png,100,0]我也是感染者，这个衣服，是——",
                "\t[塔露拉]\f[tll.png,100,0]从一个死去的贵族上抢过来的。",
                "\t[落单的感染者战士B]\f[child.png,100,0]是源石结晶，看来你确实是感染者。",
                "\t[落单的感染者战士B]\f[child.png,100,0]我们是雪怪小队是的成员，我在此先感谢你的搭救。",
                "\t[落单的感染者战士A]\f[child.png,100,0]你是谁？为什么要来这里？",
                "\t[塔露拉]\f[tll.png,100,0]你可以叫我塔露拉。",
                "\t[塔露拉]\f[tll.png,100,0]我想见见你们的领导人。",
                "\t[落单的感染者战士A]\f[child.png,100,0]你救了我们，我相信你！",
                "\t[落单的感染者战士B]\f[child.png,100,0]我也相信她，毕竟都是感染者同胞。",
                "\t[落单的感染者战士B]\f[child.png,100,0]就带她去大姊那里吧。",
                {
                    "type": "pauseBgm"
                },
                {
                    "type": "changeFloor",
                    "floorId": "MT24",
                    "loc": [
                        6,
                        8
                    ],
                    "time": 0
                }
            ]
        }
    },
    "changeFloor": {
        "6,12": {
            "floorId": "MT22",
            "loc": [
                8,
                1
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,20030,  0,20030,  0,  0,  0,  0,20030,  0,  0,  0],
    [  0,  0,  0,  0,  0,80004,  0,20030,  0,  0,  0,20030,  0],
    [  0,20030,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,80105,80128,80129,80129,80134,80129,80129,80130,  0,  0,80105],
    [80122,  0,80122,80136,80137,80137,  0,80137,80137,80138,80122,  0,80122],
    [  0,  0,80007,80144,  0,400,  0,400,  0,80146,  0,80007,  0],
    [80007,  0,  0,80144,  0,  0,  0,  0,  0,80146,80007,  0,  0],
    [  0,80007,80106,80144,  0,  0,  0,  0,  0,80146,80106,  0,80007],
    [  0,80106,80114,80152,80129,80129,231,80129,80129,80154,80114,  0,  0],
    [  0,80114,80122,80160,80137,80137,168,80137,80137,80162,80122,80105,80106],
    [80105,80122, 81, 34, 81,  0,  0,  0, 81, 34, 81,80122,80114],
    [80122, 82, 32, 82,  0,  0,  0,  0,  0, 82, 32, 82,80122],
    [ 33, 32, 82, 34, 81,  0, 93,  0, 81, 34, 82, 32, 33]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [80106,  0,  0,  0,80106,  0,  0,  0,80106,  0,80106,  0,  0],
    [80114,  0,  0,  0,80114,  0,  0,  0,80114,  0,80114,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,80134,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "weather": [
        "snow",
        5
    ],
    "beforeBattle": {},
    "cannotMoveIn": {}
}