main.floors.MT24=
{
    "floorId": "MT24",
    "title": "西北冻原",
    "name": "西北冻原",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X20000",
    "bgm": "bg.mp3",
    "firstArrive": [
        {
            "type": "playBgm",
            "name": "buan.mp3",
            "keep": true
        },
        {
            "type": "showImage",
            "code": 1,
            "image": "dust.png",
            "loc": [
                -150,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        "\t[雪怪小队成员]\f[child.png,100,0]大姊！这是......是刚才帮了我们的人！",
        "\t[霜星]\f[sx.png,100,0]别松弦。",
        {
            "type": "showImage",
            "code": 2,
            "image": "sxa.png",
            "loc": [
                100,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        "\t[塔露拉]\f[tllx.png,-100,0]哈，呼。",
        {
            "type": "showImage",
            "code": 3,
            "image": "tlla.png",
            "loc": [
                -100,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        "\t[塔露拉]\f[tllx.png,-100,0]和传闻里一样，真冷，你们雪怪。在冬天都能比这鬼天气还冷。",
        "\t[塔露拉]\f[tllx.png,-100,0]你是他们的指挥官吗？",
        "\t[霜星]\f[sx.png,100,0]感染者？",
        "\t[塔露拉]\f[tllx.png,-100,0]是。",
        "\t[霜星]\f[sx.png,100,0]解释一下，你为什么穿着乌萨斯军官的衣服。",
        "\t[塔露拉]\f[tllx.png,-100,0]我编过很多种谎话，你想听哪一种？",
        "\t[霜星]\f[sx.png,100,0]放箭。",
        "\t[塔露拉]\f[tllf.png,-100,0]等等！你真不会开玩笑。你是雪怪小队的队长？",
        "\t[霜星]\f[sx.png,100,0]为什么没放箭？",
        {
            "type": "hideImage",
            "code": 2,
            "time": 0
        },
        {
            "type": "hideImage",
            "code": 3,
            "time": 0
        },
        "\t[雪怪小队成员]\f[child.png,0,0]她刚才......真的......帮了我们，大姊。真的。",
        "\t[塔露拉]\f[tllf.png,0,0]是的，雪怪们。我来这里是想寻求帮助，以及帮助你们。",
        "\t[霜星]\f[sx.png,0,0]......帮助我们？",
        "\t[塔露拉]\f[tll.png,0,0]握个手吧，雪怪的队长！如果要表达诚意，我也希望用平等而有尊严的方式。",
        "\t[塔露拉]\f[tll.png,0,0]希望我们双方能有尊严地、平静地对话。",
        "\t[霜星]\f[sx.png,0,0]不。",
        "\t[塔露拉]\f[tll.png,0,0]......试试看。我想起你是谁了。",
        "\t[塔露拉]\f[tll.png,0,0]战场上削弱纠察队实力的冰晶，就是你制造的吧？",
        "\t[霜星]\f[sx.png,0,0]呵。",
        "\t[塔露拉]\f[tllf.png,0,0]如果我能融化你的冰的话，你会不会愿意听我说两句？",
        "\t[霜星]\f[sx.png,0,0]——夸口，你做不到。",
        {
            "type": "pauseBgm"
        },
        {
            "type": "hideImage",
            "code": 1,
            "time": 1000
        },
        "\t[塔露拉]\f[tllf.png,-100,0]试试看吧。",
        "\t[霜星]\f[sx.png,100,0]哼......",
        {
            "type": "setBlock",
            "number": "E388",
            "loc": [
                [
                    2,
                    2
                ]
            ],
            "time": 500
        },
        {
            "type": "setBlock",
            "number": "E388",
            "loc": [
                [
                    10,
                    2
                ]
            ],
            "time": 500
        },
        {
            "type": "setBlock",
            "number": "E388",
            "loc": [
                [
                    2,
                    10
                ]
            ],
            "time": 500
        },
        {
            "type": "setBlock",
            "number": "E388",
            "loc": [
                [
                    10,
                    10
                ]
            ],
            "time": 500
        },
        "\t[塔露拉]\f[tllf.png,-100,0]冰霜，冻结，你把它们化成了这个冰晶。",
        "\t[霜星]\f[sx.png,100,0]退下，我不想波及到你们。",
        "\t[雪怪小队成员]\f[child.png,100,0]\f[child.png,-100,0]好的，大姊。",
        {
            "type": "move",
            "loc": [
                5,
                5
            ],
            "time": 500,
            "async": true,
            "steps": [
                "up:5"
            ]
        },
        {
            "type": "move",
            "loc": [
                7,
                5
            ],
            "time": 500,
            "steps": [
                "up:5"
            ]
        },
        "\t[霜星]\f[sx.png,100,0]现在，这些冰晶没有威胁，这是因为我把它们设置为了对感染者友好，这是为了防止误伤到附近的人。",
        "\t[霜星]\f[sx.png,100,0]那么，就让我看看你的实力吧，信口雌黄的家伙。",
        {
            "type": "playBgm",
            "name": "hell.mp3",
            "keep": true
        },
        "\t[霜星]\f[sx.png,100,0]\r[aqua]源石冰晶，攻击模式",
        {
            "type": "waitAsync"
        },
        {
            "type": "animate",
            "name": "ice",
            "loc": [
                6,
                6
            ]
        },
        {
            "type": "changeFloor",
            "floorId": "MT25",
            "loc": [
                6,
                9
            ],
            "time": 0
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,6": {
            "trigger": null,
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "data": []
        }
    },
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,400,  0,400,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,390,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [
    [80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046],
    [80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046],
    [80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046],
    [80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046],
    [80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046],
    [80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046],
    [80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046],
    [80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046],
    [80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046],
    [80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046],
    [80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046],
    [80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046],
    [80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046,80046]
],
    "fgmap": [

],
    "beforeBattle": {},
    "cannotMoveIn": {}
}