main.floors.MT26=
{
    "floorId": "MT26",
    "title": "西北冻原",
    "name": "西北冻原",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X20000",
    "bgm": "bg.mp3",
    "firstArrive": [
        {
            "type": "playBgm",
            "name": "piaobo.mp3",
            "keep": true
        },
        {
            "type": "showImage",
            "code": 1,
            "image": "dark.png",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        "最开始成为感染者的时候，我过得浑浑噩噩的。",
        "我知道科西切想利用我做很多事，但总是在害怕，他究竟要我做什么？",
        "他是不是打算用些什么手段，让我花这么多时间建立起的感染者通信网毁于一旦？",
        "还是说，他打算让我分裂感染者，让他们分散成城市派和聚落派？",
        "更可怕的一种情况是，他会不会打算让感染者成为新的军队，重新让乌萨斯走入战争？",
        "我只能猜测。灰暗萦绕在我的头上，挥之不去。",
        "但我只能向前走",
        "\r[teal]跨出属于我的那一步",
        {
            "type": "pauseBgm"
        },
        "\t[阿丽娜]塔露拉？",
        "\t[阿丽娜]塔——露——拉？",
        {
            "type": "playBgm",
            "name": "warm.mp3",
            "keep": true
        },
        {
            "type": "showImage",
            "code": 2,
            "image": "snowconutry.png",
            "loc": [
                -100,
                0
            ],
            "opacity": 1,
            "time": 1000
        },
        {
            "type": "showImage",
            "code": 1,
            "image": "snowconutry.png",
            "loc": [
                -100,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        "\t[塔露拉]\f[tll.png,0,0]啊？什么事？",
        "\t[阿丽娜]\f[aln.png,0,0]没事，看你在思索什么的样子......",
        "\t[塔露拉]\f[tllx.png,0,0]想一些事情罢了。",
        "\t[阿丽娜]\f[aln.png,0,0]这个食物是哪来的？这味道还蛮有趣的。",
        "\t[塔露拉]\f[tllx.png,0,0]有个雪怪，似乎是叫佩特洛娃的，她昨天拿瘤奶炒了油籽，这做法真奇特。",
        "\t[阿丽娜]\f[aln.png,0,0]雪怪啊......",
        "\t[阿丽娜]\f[aln.png,0,0]那件事......我想起来了。真快，这都过去两年了。",
        "\t[阿丽娜]\f[aln.png,0,0]战士们传来传去的是真的吗？你真的和她打了一架？听说你们把那个废墟基本炸没了。",
        "\t[塔露拉]\f[tllx.png,0,0]没那么夸张。传言总是会变的匪夷所思......我只是把她的源石冰晶烧化掉了。",
        "\t[阿丽娜]\f[aln.png,0,0]萨申卡，不许乱跑，会滑倒的！",
        "\t[塔露拉]\f[tllx.png,0,0]看他们这能够自在生活的样子。挺好的。",
        "\t[阿丽娜]\f[aln.png,0,0]这就是我的职责，这些孩子本不应承受这些苦难。",
        "\t[塔露拉]\f[tllx.png,0,0]没想到你会自告奋勇去教孩子们。",
        "\t[阿丽娜]\f[aln.png,0,0]我跟孩子的感情可比跟乌萨斯之间的感情好。你刚才说你把什么东西烧化了？",
        "\t[塔露拉]\f[tllx.png,0,0]霜星的源石冰晶。她小队使用的一种法术装置，我猜。",
        "\t[阿丽娜]\f[aln.png,0,0]那可是......霜星，她肯定不服气。",
        "\t[塔露拉]\f[tllx.png,0,0]哈，没错。吐一口气的功夫，我就被她冻上了半边身子。",
        "\t[塔露拉]\f[tllx.png,0,0]等我反应过来，她已经冲着我的脖子一冰刀砍过来了。",
        "\t[塔露拉]\f[tllx.png,0,0]我拦住了她的刀，嘶的一声，这把剑这么几年来头一次结了霜。",
        "\t[塔露拉]\f[tll.png,0,0]她大概也是第一次看到有人能把她的刀切出豁口......",
        {
            "type": "showImage",
            "code": 2,
            "image": "tlla.png",
            "loc": [
                -80,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        {
            "type": "showImage",
            "code": 3,
            "image": "alna.png",
            "loc": [
                80,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        "\t[阿丽娜]\f[aln.png,80,0]啊，看得出你很乐意说这段事。你是不是还挺自豪的？",
        "\t[塔露拉]\f[tllx.png,-80,0]也没......好吧确实......呃，这个孩子，躲在牧栏后面的那个，她叫什么？",
        "\t[阿丽娜]\f[aln.png,80,0]柳包芙。别在这偷听，柳巴！下节课我就读故事给你们听。",
        "\t[阿丽娜]\f[aln.png,80,0]没错，就讲个灰色森林里的鬼魂故事吧......很可怕的故事！",
        "\t[阿丽娜]\f[aln.png,80,0]去帮老师拿些木屑来，好吗？用篮子装。谢谢你。",
        "\t[阿丽娜]\f[aln.png,80,0]——然后呢？",
        "\t[塔露拉]\f[tll.png,-80,0]霜星......阿丽娜，你也知道，这可是霜星。她的名字比我更早在西北冻原感染者术士间传开。",
        "\t[塔露拉]\f[tll.png,-80,0]她是感染者里顶尖的术师，顶尖的那种小队指挥，也是感染者里最强的战士。",
        "\t[塔露拉]\f[tll.png,-80,0]......不要误会，我没冲着这个目标去。",
        "\t[阿丽娜]\f[aln.png,80,0]可在很多人眼里，你们是有相像之处的。孩子们有的说想以后变得像霜星一样，也有的说想当你这样的英雄呢。",
        "\t[塔露拉]\f[tll.png,-80,0]停，停。我真的不喜欢这个词。你呢，阿丽娜，你又是怎么想的？",
        "\t[阿丽娜]\f[aln.png,80,0]在我眼里每个人都不一样。",
        "\t[塔露拉]\f[tllb.png,-80,0]其实，我也不太知道霜星小时候过的是怎样的生活，她的教养很好，可能她过得还不错。",
        "\t[塔露拉]\f[tllb.png,-80,0]可别让任何一个孩子经历我经历的这些。",
        "\t[阿丽娜]\f[aln.png,80,0]但是你也很有教养。",
        "\t[塔露拉]\f[tllb.png,-80,0]......算了吧，我不愿提起这件事。",
        "\t[阿丽娜]\f[aln.png,80,0]......塔露拉，我们谁也不知道这片大地留给他们的遭遇，会不会比我们遇见过的更荒唐。",
        "\t[阿丽娜]\f[aln.png,80,0]这也是我想做老师的原因。",
        "\t[塔露拉]\f[tll.png,-80,0]......我明白你的意思了。你是说霜星也许也......",
        "\t[阿丽娜]\f[aln.png,80,0]谁知道呢。没有一个感染者的人生是相同的。",
        "\t[塔露拉]\f[tll.png,-80,0]总之，和霜星争执过后，我就再也没敢在技巧训练上懈怠过。别说法术，剑术也是。这些我可都不能输给她。",
        "\t[阿丽娜]\f[aln.png,80,0]你和她打了一架我知道了，然后呢？",
        "\t[塔露拉]\f[tll.png,-80,0]撑到她气消了，她才告诉我这事她不做主。",
        "\t[阿丽娜]\f[aln.png,80,0]那就是说......",
        "\t[塔露拉]\f[tll.png,-80,0]是的，在我们这场斗殴结束后没过多久......",
        "\t[塔露拉]\f[tll.png,-80,0]......从城市的另一端走来了一个......",
        "\t[塔露拉]\f[tllb.png,-80,0]......人。",
        "\t[阿丽娜]\f[aln.png,80,0]回想一下都那么费力？",
        "\t[塔露拉]\f[tll.png,-80,0]应该说是第一眼印象太震撼，使得我只能想方设法挑一些词给你。",
        "\t[塔露拉]\f[tll.png,-80,0]中午的阳光倾洒在他身上，居然照不化他身上淤泥一样的黑色。",
        "\t[塔露拉]\f[tll.png,-80,0]我正和霜星说着我的计划，我说到我会联系上其他城市的感染者。",
        "\t[塔露拉]\f[tll.png,-80,0]我想要调集资金建造或者谋取小型的移动城市，我邀请他们加入计划......",
        "\t[塔露拉]\f[tll.png,-80,0]我看到他的影子。我说不下去了。",
        "\t[阿丽娜]\f[aln.png,80,0]为什么停下？",
        "\t[塔露拉]\f[tll.png,-80,0]我可不那么有自信。",
        "\t[阿丽娜]\f[aln.png,80,0]你也会没自信？我从来没见你不自信过。",
        "\t[塔露拉]\f[tllb.png,-80,0]那可是......爱国者。",
        {
            "type": "hideImage",
            "code": 2,
            "time": 0
        },
        {
            "type": "hideImage",
            "code": 3,
            "time": 0
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "showImage",
            "code": 2,
            "image": "dark.png",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 500
        },
        "\t[塔露拉]\f[tllb.png,-80,0]我没能说服他。",
        {
            "type": "showImage",
            "code": 1,
            "image": "fg.png",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "kuchu.mp3",
            "keep": true
        },
        "\t[霜星]我们甚至不知道冻原上还有多少感染者活在乌萨斯的混蛋统治下，在这时候和游击队说城市的那些感染者，太早了。",
        "\t[塔露拉]我们迟早有一天要回来。我们的目标是让乌萨斯，不，整片大地的感染者团结起来......",
        "\t[塔露拉]也许我们身处不同的地方，但是我们对自己境遇的不甘没有区别。",
        "\t[塔露拉]我在某座城市中的朋友把这种行为叫做“整合”。",
        "\t[塔露拉]他呼吁感染者团结起来，自称“整合运动”，围绕同一个信念，抗议乌萨斯现在这种对感染者的残酷统治。",
        "\t[霜星]塔露拉，不说乌萨斯的百姓，我们只说军队，乌萨斯军是不会放过我们任何人的。",
        "\t[霜星]如果你去南方是为了“抗议”，那我们不如直接去找一个师团送命。",
        "\t[塔露拉]乌萨斯不是一块铁板。这是我们的机会。整合运动所要做的是传递信念，只是我看到了更多机会。我们还要传递一个信号。",
        "\t[霜星]什么信号？",
        "\t[塔露拉]“你们并不孤单。”",
        "\t[霜星]——",
        "\t[霜星]你很强，你带着他们走了很长的路，和我们一样。",
        "\t[霜星]但向南方去就是种幻想。",
        "\t[霜星]游击队在壮大，但我们是感染者。",
        "\t[霜星]我们没剩下几年时间......而你的联合又需要多少年......",
        "\t[塔露拉]正因如此——",
        {
            "type": "playSound",
            "name": "d_gen_walk_n.wav"
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[霜星]爸？",
        "\t[塔露拉] 啊......",
        "\t[塔露拉]爱国者先生？",
        {
            "type": "moveImage",
            "code": 1,
            "to": [
                -200,
                0
            ],
            "time": 1000
        },
        "爱国者在篝火旁坐下。和塔露拉不断在脑海中模拟的场景一样，爱国者只是坐下，一言不发，注视着篝火。",
        "\t[霜星]......",
        "\t[霜星]没事的。你继续说。",
        "\t[塔露拉]正因为我们不剩下多少时间了。",
        "\t[塔露拉]南方有丰产的田地，有适宜的温度，有四季变化，有新鲜的食物。",
        "\t[塔露拉]资源，教育，前景......",
        "\t[塔露拉]以及未来。",
        "\t[霜星]——未来？",
        "\t[塔露拉]以及未来。",
        "\t[霜星]我不知道什么叫做“未来”。",
        "\t[塔露拉]但感染者应该有未来。属于未来的感染者的，属于我们之后的人的。",
        "\t[塔露拉]霜星......我们给那些感染者找一个家。",
        "\t[塔露拉]可以不被乌萨斯的感染者纠察队骚扰的地方，不被乌萨斯军队所包围的地方。",
        "\t[霜星]这将是条艰难的道路。",
        "\t[塔露拉]至少，我们在死前创造的那些希望，是可以留给其他人的。",
        "\t[塔露拉]以及，如果我们推翻乌萨斯现在这个感染者制度......",
        "\t[霜星]我们势单力薄。",
        "\t[霜星]如果你不是感染者，你会和我握手吗？",
        "\t[塔露拉]那我们就从握手开始做起。",
        "\t[霜星]......你说的这些......可能......",
        "\t[霜星]爸，你去哪？",
        "\t[爱国者]已经够了。",
        "\t[塔露拉]先生......",
        "\t[霜星]唉......别太在意。",
        {
            "type": "showImage",
            "code": 2,
            "image": "dark.png",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 500
        },
        {
            "type": "showImage",
            "code": 1,
            "image": "snowconutry.png",
            "loc": [
                -200,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 500
        },
        {
            "type": "showImage",
            "code": 2,
            "image": "tll.png",
            "loc": [
                -80,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        {
            "type": "showImage",
            "code": 3,
            "image": "aln.png",
            "loc": [
                80,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        "\t[阿丽娜]\f[alnj.png,80,0]他可能只是在考虑。",
        "\t[塔露拉]\f[tll.png,-80,0]那他也确实考虑很久了。",
        "\t[塔露拉]\f[tll.png,-80,0]两年来，我和他的所有谈话也都只是关于队伍建设和接下来的安排。他从来没有一次问起我有关的计划。",
        "\t[阿丽娜]\f[alnj.png,80,0]塔露拉，不管他是在嘲笑你还是在反对你——啊，我觉得他不太像是个会嘲笑别人的人——你都会等下去的。我有没有说错？",
        "\t[塔露拉]\f[tll.png,-80,0]想走出冻原，我们不能没有游击队的力量。我会坚持。",
        "\t[阿丽娜]\f[alnj.png,80,0]因为他是冻原感染者的希望？",
        "\t[塔露拉]\f[tll.png,-80,0]我以为你不会这么说。如果是你应该......不会这么说？",
        "\t[阿丽娜]\f[alnj.png,80,0]我就是想知道你的想法。",
        "\t[塔露拉]\f[tll.png,-80,0]......我想，是因为他才是那个冻原感染者团结的象征。",
        "\t[塔露拉]\f[tll.png,-80,0]这个象征是没办法被传递到下一代手里的。",
        {
            "type": "showImage",
            "code": 1,
            "image": "dark.png",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        {
            "type": "changeFloor",
            "floorId": "MT27",
            "loc": [
                6,
                11
            ],
            "time": 0
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [

],
    "fgmap": [

],
    "beforeBattle": {},
    "cannotMoveIn": {}
}