main.floors.MT27=
{
    "floorId": "MT27",
    "title": "西北冻原",
    "name": "西北冻原",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 3,
    "defaultGround": "X20000",
    "bgm": "bg.mp3",
    "firstArrive": [
        {
            "type": "hideImage",
            "code": 3,
            "time": 0
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 0
        },
        {
            "type": "playBgm",
            "name": "buan.mp3",
            "keep": true
        },
        "泰拉1091年",
        "某乌萨斯纠察队据点",
        {
            "type": "showImage",
            "code": 1,
            "image": "dust.png",
            "loc": [
                -300,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        {
            "type": "playSound",
            "name": "118-Fire02.ogg"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "p_skill_blacktimewand.wav"
        },
        "\t[塔露拉]\f[tlln.png,0,0]撑住！我们需要为其他小队夺取矿区核心区域拖延时间!",
        "\t[塔露拉]\f[tlln.png,0,0]霜星，这次的部队是什么来头？他们的装备和作战水平和我之前作战过的完全不一样！",
        "\t[霜星]\f[sx.png,0,0]切！",
        "\t[霜星]\f[sx.png,0,0]兄弟姐妹，撤退！让他们追！把矿场的守军引出来！",
        {
            "type": "playSound",
            "name": "d_gen_surfacefrozen.wav"
        },
        "\t[霜星]\f[sx.png,0,0]雪怪们，保持住队形！",
        {
            "type": "playSound",
            "name": "p_skill_huirenzhan.wav"
        },
        "\t[塔露拉]\f[tlln.png,0,0]你有听我说话吗，白兔子?",
        "\t[塔露拉]\f[tllf.png,0,0]清一色的乌萨斯军队制式装备......这是正常的情况吗？",
        "\t[霜星]\f[sx.png,0,0]啊啊，这是乌萨斯正规军队驻扎的矿场。",
        "\t[塔露拉]\f[tlln.png,0,0]什么？等等，之前调查的结果并不是——",
        "\t[霜星]\f[sx.png,-100,0]你下达的指挥命令是，消灭这只连队。",
        "\t[塔露拉]\f[tlln.png,0,0]就算有爱国者部队的盾卫支援我们......但那可是乌萨斯正规军啊？",
        "\t[霜星]\f[sx.png,-100,0]没问题的，塔露拉，你先去他们内部进行拖延和破坏，我去办一些事情。",
        "\t[塔露拉]\f[tll.png,100,0]......好，我相信你。",
        {
            "type": "playBgm",
            "name": "01.mp3",
            "keep": true
        },
        {
            "type": "setValue",
            "name": "flag:bgm",
            "value": "4"
        },
        "\t[塔露拉]\f[tlln.png,100,0]为了感染者的未来。",
        {
            "type": "hideImage",
            "code": 1,
            "time": 0
        },
        "由于经历了长久的训练，塔露拉变得更强了。",
        "攻击力/防御力+20，源石和血瓶的效果提升。",
        {
            "type": "setValue",
            "name": "status:atk",
            "operator": "+=",
            "value": "20"
        },
        {
            "type": "setValue",
            "name": "status:def",
            "operator": "+=",
            "value": "20"
        },
        {
            "type": "if",
            "condition": "(flag:h<=2)",
            "true": [
                "普通难度福利",
                {
                    "type": "setValue",
                    "name": "status:mana",
                    "operator": "+=",
                    "value": "100"
                },
                {
                    "type": "setValue",
                    "name": "status:hp",
                    "operator": "+=",
                    "value": "10000"
                },
                {
                    "type": "setValue",
                    "name": "item:yellowKey",
                    "operator": "+=",
                    "value": "3"
                },
                {
                    "type": "setValue",
                    "name": "item:blueKey",
                    "operator": "+=",
                    "value": "1"
                }
            ]
        },
        {
            "type": "if",
            "condition": "(flag:h<=1)",
            "true": [
                "简单难度福利",
                {
                    "type": "setValue",
                    "name": "status:mana",
                    "operator": "+=",
                    "value": "200"
                },
                {
                    "type": "setValue",
                    "name": "status:hp",
                    "operator": "+=",
                    "value": "20000"
                },
                {
                    "type": "setValue",
                    "name": "item:yellowKey",
                    "operator": "+=",
                    "value": "3"
                },
                {
                    "type": "setValue",
                    "name": "item:blueKey",
                    "operator": "+=",
                    "value": "2"
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            3,
                            11
                        ]
                    ],
                    "floorId": "MT20",
                    "remove": true
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "2,0": {
            "floorId": "MT28",
            "loc": [
                6,
                12
            ]
        },
        "0,5": {
            "floorId": "MT30",
            "loc": [
                12,
                6
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {
        "5,3": [
            "up"
        ],
        "6,3": [
            "up"
        ],
        "7,3": [
            "up"
        ],
        "8,3": [
            "up"
        ],
        "8,4": [
            "right"
        ],
        "8,5": [
            "right"
        ],
        "8,6": [
            "right"
        ]
    },
    "map": [
    [ 27,80007, 91,80007,  0, 32,80007,  0,80007, 28,80007, 30, 30],
    [  0,80007, 28, 81, 30,  0,416,  0,80007,418,80007,80007, 81],
    [ 27,347,  0,80007,  0, 32, 81,  0,  0,  0,  0,  0,  0],
    [30048,80007,80007,80007,80007, 32, 27, 32,30050,80007,416,80007,30048],
    [80007,  0, 33,  0, 81,345, 28,80007,30058, 31,  0, 31,30056],
    [ 92,347,  0,80007,80007,80007, 27,80007,30058, 81,345, 82,30056],
    [80007,  0, 33,416, 32, 33,80007,  0,30058, 81,  0, 34,30056],
    [30064,30065,  0,30065,30065,30065,30065,30065,30066,  0, 29,  0,30064],
    [30080,30081,  0,30081,30081,30081,30081,30081,30082,80007,418, 81,30080],
    [  0,  0, 33,  0, 21,  0,246,  0, 21,  0, 33,  0,  0],
    [416,80007, 81,345,80007,80007,  0,80007,80007,416,80007,80007,416],
    [ 29,80007, 28,  0,80007, 30,  0, 34,80007,  0, 29,80007, 21],
    [ 27,80007,  0, 21,80007,  0,  0,  0,80007, 31,  0,80007, 21]
],
    "bgmap": [
    [  0,  0,  0,  0,20016,  0,  0,20016,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,20017,  0,  0,  0,  0,  0,  0,  0,  0,20016,  0],
    [  0,30049,30049,30049,30049,30049,30049,30049,  0,  0,  0,  0,  0],
    [30051,20016,  0,  0,  0,  0,  0,  0,20016,  0,  0,  0,  0],
    [  0,  0,20017,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [30059,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,30113,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,30131,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [20016,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20016],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,20016,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,80014,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "beforeBattle": {},
    "cannotMoveIn": {
        "5,3": [
            "up"
        ],
        "6,3": [
            "up"
        ],
        "7,3": [
            "up"
        ],
        "8,3": [
            "up"
        ],
        "8,4": [
            "right"
        ],
        "8,5": [
            "right"
        ],
        "8,6": [
            "right"
        ]
    }
}