main.floors.MT34=
{
    "floorId": "MT34",
    "title": "移动城市外围",
    "name": "PRTS",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 3,
    "defaultGround": "X10000",
    "bgm": "bg.mp3",
    "firstArrive": [
        {
            "type": "playBgm",
            "name": "kuchu.mp3",
            "keep": true
        },
        "我们一路向南",
        "我们赶在各矿场的感染者灭绝计划之前尽可能多地救下感染者。",
        "我们一边躲避着乌萨斯的常规军，一边在他们的眼皮底下救下感染者。",
        "我们一路走，一路扩大着我们的队伍。",
        "这么做的理由，我想只能说是“我们应该这么做”。",
        "但我想，通过吸纳更多感染者，为其他部队争取空间，同样也在爱国者先生的战略规划之内。",
        "爱国者可能划下了一条线，一条我们不会跨过的线。",
        "跨过那条线意味着我们要么和乌萨斯驻军正面开战——这是绝对不可能的事——要么，我们就必须潜伏起来。",
        "也就是说，离开雪原可能意味着，我们要隐秘地迈入乌萨斯真正的疆域，被严苛法度管辖着的移动领土。",
        "荒野里活跃着乌萨斯的军舰，城镇对感染者只会更加残忍。那一定会是一段艰难的日子。",
        "但是冻原中有什么？雪。",
        "雪......雪......还是雪。",
        "只有雪的土地养活不了我们这么多人。",
        "但是，只要我们团结起来，就能度过一切难关。",
        "阿丽娜是这么说的。",
        "泰拉1092年",
        {
            "type": "showImage",
            "code": 2,
            "image": "dust.png",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        "\t[佩特洛娃]\f[child.png,-100,0]兄弟姐妹们，没事吧？！",
        "\t[佩特洛娃]\f[child.png,-100,0]真是一场恶战......",
        "\t[塔露拉]\f[tllx.png,100,0]终于......",
        {
            "type": "showImage",
            "code": 3,
            "image": "grzzsa.png",
            "loc": [
                -100,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        {
            "type": "showImage",
            "code": 4,
            "image": "tlla.png",
            "loc": [
                100,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        "\t[感染者战士]\f[grzzs.png,-100,0]我们......我们夺下了一个移动城市？",
        "\t[塔露拉]\f[tllx.png,100,0]是的，同胞们，虽然只是一个很破旧的，即将被拆迁的移动城市。",
        "\t[感染者战士]\f[grzzs.png,-100,0]塔露拉......你还记得我吗？",
        "\t[塔露拉]\f[tll.png,100,0]我记得......我记得你是蜷耳村的感染者领头人。",
        "\t[塔露拉]\f[tllx.png,100,0]有什么事吗？突然问这个？",
        "\t[感染者战士]\f[grzzs.png,-100,0]我们可也是个大队！和你们游击队没什么两样。",
        "\t[塔露拉]\f[tllx.png,100,0]有些遗憾，因为我不是游击队。",
        "\t[感染者战士]\f[grzzs.png,-100,0]但我们这回出的人比你们多得多。",
        "\t[塔露拉]\f[tll.png,100,0]......你叫我有什么事？",
        "\t[感染者战士]\f[grzzs.png,-100,0]我们就在这里分道扬镳吧，塔露拉。",
        "\t[感染者战士]\f[grzzs.png,-100,0]我们也和你们一起打了很多场仗了！我们也为你们做了很多事，这座城市的资源五五分成，给你们多一点也没关系！但是城市要......留给我们。",
        "\t[塔露拉]\f[tlln.png,100,0]\r[red]——你是认真的？",
        "\t[感染者战士]\f[grzzs.png,-100,0]我们可以靠这个移动城市活下去！我们可以利用它去很多地方，甚至躲避纠察队和乌萨斯驻军！",
        "\t[塔露拉]\f[tllf.png,100,0]你们不愿意继续战斗了？",
        "\t[感染者战士]\f[grzzs.png,-100,0]会死的。",
        "\t[感染者战士]\f[grzzs.png,-100,0]塔露拉，敌人越来越强......我们......",
        "\t[感染者战士]\f[grzzs.png,-100,0]我们已经不想和你继续走下去了。",
        "\t[感染者战士]\f[grzzs.png,-100,0]塔露拉，你不会不同意的，对吧？对吧！",
        "\t[塔露拉]\f[tll.png,100,0]......",
        {
            "type": "hideImage",
            "code": 3,
            "time": 0
        },
        {
            "type": "hideImage",
            "code": 4,
            "time": 0
        },
        "\t[佩特洛娃]\f[child.png,0,0]你这是在说什么？这是背叛！",
        "\t[感染者战士]\f[grzzs.png,0,0]哈......嘿嘿嘿，你们雪怪的血都是冷的......你们肯定不怕死了......",
        "\t[佩特洛娃]\f[child.png,0,0]你！",
        "\t[塔露拉]\f[tll.png,0,0]（挥手示意）停下，佩特洛娃。",
        "\t[塔露拉]\f[tll.png,0,0]那我们会立刻取走资源，这座城市就留给你们。",
        "\t[塔露拉]\f[tll.png,0,0]但是，不准侮辱任何一个战士。向雪怪道歉。",
        "\t[感染者战士]\f[grzzs.png,0,0]......咳咳，对不起。",
        "\t[感染者战士]\f[grzzs.png,0,0]——这样行了吧？",
        "\t[塔露拉]\f[tllb.png,0,0]佩特洛娃，过来清点资源。",
        {
            "type": "hideImage",
            "code": 1,
            "time": 0
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 0
        },
        "\t[塔露拉]\f[tllb.png,0,0]拿走一些物资就走吧......当然也可以给他们留一点。",
        {
            "type": "if",
            "condition": "(flag:h<=2)",
            "true": [
                "普通难度福利",
                {
                    "type": "openDoor",
                    "loc": [
                        2,
                        6
                    ]
                },
                {
                    "type": "openDoor",
                    "loc": [
                        10,
                        6
                    ]
                }
            ]
        },
        {
            "type": "if",
            "condition": "(flag:h<=1)",
            "true": [
                "简单难度福利",
                {
                    "type": "openDoor",
                    "loc": [
                        2,
                        3
                    ]
                },
                {
                    "type": "openDoor",
                    "loc": [
                        10,
                        3
                    ]
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            3,
                            11
                        ]
                    ],
                    "floorId": "MT20",
                    "remove": true
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,12": [
            "\t[塔露拉]\f[tllb.png,0,0]我已经答应他们了。",
            "\t[塔露拉]\f[tllx.png,0,0]希望他们可以好好的活下去。"
        ],
        "7,6": [
            "大片的鲜血，可见这里经历了多么激烈的战斗。"
        ],
        "5,11": [
            "大片的鲜血，可见这里经历了多么激烈的战斗。"
        ],
        "1,7": [
            "大片的鲜血，可见这里经历了多么激烈的战斗。"
        ],
        "9,5": [
            "大片的鲜血，可见这里经历了多么激烈的战斗。"
        ],
        "5,4": [
            "大片的鲜血，可见这里经历了多么激烈的战斗。"
        ],
        "6,0": [
            {
                "type": "pauseBgm"
            },
            "\t[塔露拉]\f[tll.png,-100,0]雪怪们，走吧。",
            "\t[塔露拉]\f[tll.png,-100,0]希望他们可以过下去。",
            "\t[佩特洛娃]\f[child.png,100,0]......好吧。",
            "\t[塔露拉]\f[tll.png,-100,0]联系一下游击队，我们和他们汇合。",
            "\t[佩特洛娃]\f[child.png,100,0]明白。",
            {
                "type": "showImage",
                "code": 1,
                "image": "dark.png",
                "loc": [
                    0,
                    0
                ],
                "opacity": 1,
                "time": 0
            },
            {
                "type": "changeFloor",
                "floorId": "MT35",
                "loc": [
                    6,
                    12
                ],
                "time": 500
            }
        ]
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10044,10044,10044,10044,10044,10044, 91,10044,10044,10044,10044,10044,10044],
    [10044, 29, 33, 33, 34,10044,  0,10044, 34, 33, 33, 29,10044],
    [10044, 33, 33, 30, 29,10044,  0,10044, 29, 30, 33, 33,10044],
    [10044,10044, 85,10044,10044,10044,  0,10044,10044,10044, 85,10044,10044],
    [10044, 30, 32, 34,10044,413,  0,  0,10044, 34, 32, 30,10044],
    [10044,  0, 21,  0,10044,10044,  0,10044,10044,413, 22,  0,10044],
    [10044,10044, 85,10044,10044,  0,  0,413,10044,10044, 85,10044,10044],
    [10044,413, 31,  0,10044,  0,  0,  0,10044,  0, 31,  0,10044],
    [10044, 31, 33, 31,103,  0,  0,  0,103, 31, 33, 31,10044],
    [10044,  0, 31,  0,  0,  0,  0,  0,  0,  0, 31,  0,10044],
    [10044,  0, 21,  0,10044,  0,  0,  0,10044,  0, 21,  0,10044],
    [10044, 28,  0, 27,10044,413,  0,  0,10044, 27,  0, 28,10044],
    [10044,10044,10044,10044,10044,10044, 93,10044,10044,10044,10044,10044,10044]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,80012,  0,  0,  0,80012,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "weather": [
        "snow",
        6
    ]
}