main.floors.MT35=
{
    "floorId": "MT35",
    "title": "郊外",
    "name": "PRTS",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 3,
    "defaultGround": "X20000",
    "bgm": "bg.mp3",
    "firstArrive": [
        {
            "type": "showImage",
            "code": 1,
            "image": "forest.png",
            "loc": [
                -200,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        "\t[塔露拉]\f[tll.png,0,0]......",
        "\t[塔露拉]\f[tllf.png,0,0]这是？",
        "\t[佩特洛娃]\f[child.png,0,0]！这，是附近回防移动城市的部队。",
        "\t[塔露拉]\f[tll.png,0,0]移动城市躲避这些部队需要多久？",
        "\t[佩特洛娃]\f[child.png,0,0]以那座城市的速度及规模，大概需要三个小时。",
        "\t[塔露拉]\f[tll.png,0,0]......该死，我们身上被贴了信号发射源，不然部队不可能追踪到我们这支小部队而非移动城市！",
        "\t[佩特洛娃]\f[child.png,0,0]那些杂碎，他们想让我们来应付回防部队，这样好让自己逃之夭夭！",
        "\t[塔露拉]\f[tll.png,0,0]没办法了，佩特洛娃，你与我一起行动。",
        "\t[塔露拉]\f[tll.png,0,0]联系游击队，让他们想办法支援我们。",
        "\t[塔露拉]\f[tll.png,0,0]其余小队分散开来，我打主攻，你和你的术士小队负责掩护我。",
        "\t[佩特洛娃]\f[child.png,0,0]明白。",
        {
            "type": "setValue",
            "name": "flag:bgm",
            "value": "4"
        },
        {
            "type": "playBgm",
            "name": "xisheng.mp3",
            "keep": true
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 500
        },
        {
            "type": "hideImage",
            "code": 1,
            "time": 500
        },
        "\t[乌萨斯剑豪]目标源正在靠近。",
        "\t[血十字剑豪]感染者检测装置由反应，确系是感染者，应该是攻击移动城市的人。",
        "\t[血十字剑豪]\r[red]进行清除！",
        "\t[塔露拉]\f[tlln.png,0,0]佩特洛娃！",
        {
            "type": "showImage",
            "code": 1,
            "image": "forest.png",
            "loc": [
                -200,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        "\t[佩特洛娃]\f[child.png,0,0]弟兄们，塔露拉领袖需要我们！",
        "\t[佩特洛娃]\f[child.png,0,0]尽管做你们拿手的事情！支援领袖！别忘了大姊教我们的法术！",
        "\t[雪怪们]\f[child.png,-50,0]\f[child.png,50,0]收到！",
        {
            "type": "hideImage",
            "code": 1,
            "time": 0
        },
        {
            "type": "animate",
            "name": "zone",
            "loc": [
                6,
                10
            ]
        },
        {
            "type": "setBlock",
            "number": "E388",
            "loc": [
                [
                    6,
                    10
                ]
            ],
            "time": 0
        },
        "\t[乌萨斯剑豪]这是什么？",
        "\t[血十字剑豪]无视他，兄弟们，这个东西无法对我们造成伤害......等等",
        "\t[血十字剑豪]我们的速度......变慢了？",
        "\t[塔露拉]\f[tllf.png,0,0]\r[red]废什么话，死吧。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,0": {
            "floorId": "MT36",
            "loc": [
                6,
                12
            ],
            "direction": "up"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "5,11": [
            {
                "type": "setValue",
                "name": "flag:door_MT35_6_9",
                "operator": "+=",
                "value": "1"
            }
        ],
        "7,11": [
            {
                "type": "setValue",
                "name": "flag:door_MT35_6_9",
                "operator": "+=",
                "value": "1"
            }
        ],
        "6,11": [
            {
                "type": "setValue",
                "name": "flag:door_MT35_6_9",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "6,9": {
            "0": {
                "condition": "flag:door_MT35_6_9==3",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "openDoor",
                        "loc": [
                            8,
                            11
                        ]
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_MT35_6_9",
                        "value": "null"
                    },
                    "\t[塔露拉]\f[tll.png,0,0]如同刚才那样，我可以随时召唤一个冰晶到战场上，但是刚才有预留的坐标，而现在没有了。",
                    "\t[塔露拉]\f[tll.png,0,0]我现在只能联系雪怪小队把冰晶\r[gold]召唤到我面前的一个空地上。",
                    "\t[塔露拉]\f[tll.png,0,0]我们还有两颗冰晶的储备，一定要谨慎使用。",
                    "\t[塔露拉]\f[tll.png,0,0]这个道具的持续时间似乎只有这次行动，所以我留着也没用——",
                    "\t[塔露拉]\f[tll.png,0,0]为什么我要这样说？讲解给谁听吗？",
                    {
                        "type": "setValue",
                        "name": "item:I393",
                        "operator": "+=",
                        "value": "2"
                    }
                ]
            },
            "1": null
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [90181, 33, 28,222, 32, 34, 91,90178,90200,90194,90195,90194,90195],
    [90189,90181,422, 81, 27,90205,90204,90186,90208,90202,90203,90202,90203],
    [90204,90189,  0,90204,90166,90167, 27,227, 28,90194,90195,90194,90195],
    [ 27,90179, 29, 32,90174,90175,90165, 81,90208,90202,90203,90202,90203],
    [ 28,90200,90201, 30, 32,221, 32,  0, 28,90208,90209,90208,90209],
    [ 81,90208,90209,90204, 29,90200,90201, 27,  0, 29,90165,  0, 21],
    [422,  0, 21,  0,90164,90208,90200,90201,90180,  0, 81, 21,  0],
    [90179, 21, 34,227,  0, 32,90208,90209,90205,90204,90200,90201,226],
    [90200,90201,90200,90201, 33,  0, 31,222, 21, 27,90208,90209,  0],
    [90194,90195,90194,90195,90201,90204, 85,90166,90167,90204,  0, 34, 31],
    [90202,90203,90202,90203,90209,  0,  0,90174,90175, 31, 81,90181,90204],
    [90194,90195,90194,90195,90201,422,423,226, 85,  0,90180,90189,90181],
    [90202,90203,90202,90203,90209,90180,  0,90180,90204,221, 32, 30,90189]
],
    "bgmap": [
    [  0,  0,  0,  0,30005,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,30011,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,30004,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [30005,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,30004,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,90209,  0,  0,  0,  0,  0,  0],
    [  0,  0,30004,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,30004,  0,  0,  0,  0,  0,  0,30005],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30003,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,30004,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,30011,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,90200,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "weather": [
        "snow",
        6
    ]
}