main.floors.MT39=
{
    "floorId": "MT39",
    "title": "移动城市外围",
    "name": "PRTS",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 3,
    "defaultGround": "X20000",
    "bgm": "bg.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "5,6": {
            "trigger": null,
            "enable": true,
            "noPass": true,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "哦，这是一截枯木",
                "但是似乎有人将其供奉了起来。",
                "——不明所以,为什么会有人供奉一个如此破旧的东西？",
                {
                    "type": "setValue",
                    "name": "flag:j3",
                    "value": "1"
                },
                {
                    "type": "setValue",
                    "name": "flag:bgm",
                    "value": "4"
                },
                {
                    "type": "choices",
                    "text": "\t[PRTS]发现记忆碎片\r[olive]\"所谓救世主\"\r，是否查看？",
                    "choices": [
                        {
                            "text": "是",
                            "action": [
                                {
                                    "type": "playBgm",
                                    "name": "piaobo.mp3",
                                    "keep": true
                                },
                                {
                                    "type": "showImage",
                                    "code": 1,
                                    "image": "forest.png",
                                    "loc": [
                                        0,
                                        0
                                    ],
                                    "opacity": 1,
                                    "time": 1000
                                },
                                "一个年轻人正在询问一个老者统治之道",
                                "\t[浑厚的声音]——你有没有在丛林的深处，看到过被供奉起来的树木？",
                                "\t[年轻的声音]有，但是，为什么？",
                                "\t[年轻的声音]这种行为，有什么意义吗？",
                                "\t[年轻的声音]供奉树木能带来什么，为什么不去供奉神灵大人？",
                                "\t[浑厚的声音]你难道不明白吗，这个树，就是他们的神灵，他们的救世主。",
                                "\t[年轻的声音]这？不可理喻......",
                                "\t[浑厚的声音]他们是在森林中躲藏的氏族，对于他们来讲，一些树就是他们的神。",
                                "\t[浑厚的声音]可能是这些树让他们躲避了猛兽的袭击，也可能是他们走头无路时看到了一颗硕果累累的树。",
                                "\t[浑厚的声音]没错，只需要这么简单的方法，一棵树就能成为人们心中的神。",
                                "\t[浑厚的声音]但是，如果这棵树不再给他们提供这些便利了呢，甚至，只是提供的东西变少了呢？",
                                "\t[浑厚的声音]“这棵树为什么产出的果子变少了？一定是它的问题，它不爱我们了。”",
                                "\t[年轻的声音].........神的地位会变吗？",
                                "\t[浑厚的声音]会，而且他们会将之前视为神的树踩在脚下，将其砍伐。",
                                "\t[年轻的声音]这些氏族......未免也太忘恩负义了点，不过话说回来，也就是一棵树，没什么大不了的。",
                                "\t[浑厚的声音]你说的没错，因为那时，在他们眼中，只是一棵树而已......",
                                {
                                    "type": "showImage",
                                    "code": 1,
                                    "image": "forest.png",
                                    "loc": [
                                        0,
                                        0
                                    ],
                                    "opacity": 1,
                                    "time": 1000
                                },
                                "\t[模糊不清的声音]***只是\r[red]一个人而已\r，并不是我们的救世主。",
                                "\t[模糊不清的声音]她给我们的东西越来越少了，却让我们干越来越危险的工作。",
                                "\t[模糊不清的声音]拿下***后我们就要求分开，这次行动我们兄弟最多，就是不允许我们也能硬抢。",
                                "\t[模糊不清的声音]物资留吗？",
                                "\t[模糊不清的声音]他们当然可以拿一部分，就当是保护我们的慰问品了。",
                                "\t[模糊不清的声音]城外的回防部队.......我们可消受不起。",
                                {
                                    "type": "hideImage",
                                    "code": 1,
                                    "time": 0
                                },
                                {
                                    "type": "hideImage",
                                    "code": 2,
                                    "time": 0
                                },
                                {
                                    "type": "playBgm",
                                    "name": "xisheng.mp3",
                                    "keep": true
                                }
                            ]
                        },
                        {
                            "text": "否",
                            "action": []
                        }
                    ]
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            5,
                            6
                        ]
                    ],
                    "remove": true
                },
                {
                    "type": "hide",
                    "loc": [
                        [
                            5,
                            7
                        ]
                    ],
                    "remove": true
                }
            ]
        }
    },
    "changeFloor": {
        "6,12": {
            "floorId": "MT38",
            "loc": [
                6,
                0
            ]
        },
        "6,0": {
            "floorId": "MT40",
            "loc": [
                6,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [90194,90195,90194,90195,90201,90179, 91,90180,90166,90182,90183,90182,90183],
    [90202,90203,90202,90203,90209,  0,  0, 29,90174,90190,90191,90190,90191],
    [90194,90195,90201,90209,  0,232,80007, 33, 29,90174,90175,90182,90183],
    [90202,90203,90209,  0,90180,  0, 32,90198,90199,90171,90174,90190,90191],
    [90208,90209, 32,426,  0, 34,  0,221,  0, 33,90162,90174,90175],
    [90181, 31, 30, 34,90179,30212,30213,90179, 33,  0,222, 27,90204],
    [90189,  0,90164,  0,90205, 90,30215,90204,232,90180,90200,90201,90200],
    [90171,90198,90199,  0,90204, 91,90205,90204, 28,90200,90194,90195,90194],
    [90181,90165, 32,222,  0, 30,  0,90205,90200,90208,90202,90203,90202],
    [90189, 32, 27,90163,221,90205,90204,90200,90194,90195,90194,90195,90194],
    [90166,90167,90166,90167, 32, 27, 34,90208,90202,90203,90202,90203,90202],
    [90182,90183,90182,90183,90167,90178, 28,90200,90194,90195,90194,90195,90194],
    [90190,90191,90190,90191,90175,90186, 93,90208,90202,90203,90202,90203,90202]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,20011,30005,  0,  0,  0,  0,  0],
    [  0,  0,90208,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,30004,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,30003,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,30004,  0,  0,90198,90199,  0,  0,  0,30004,  0,  0],
    [  0,  0,  0,  0,  0,30214,  0,  0,30011,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,30005,  0,  0,  0,30004,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,20011,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90166,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,90201,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "weather": [
        "snow",
        6
    ]
}