main.floors.MT41=
{
    "floorId": "MT41",
    "title": "西北冻原",
    "name": "PRTS",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 2,
    "defaultGround": "X20000",
    "bgm": "bg.mp3",
    "firstArrive": [
        {
            "type": "showImage",
            "code": 2,
            "image": "snowconutry.png",
            "loc": [
                -100,
                0
            ],
            "opacity": 1,
            "time": 500
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "piaobo.mp3",
            "keep": true
        },
        "我不知道我还要走多远。",
        "我偶尔会听见冬羽们清脆的叫声，那代表什么？是不是说春天快来了？",
        "经过三个星期，我们终于又找到了两个愿意和感染者交换物资的村庄。",
        "树根实在是不好吃，我不想再听爱国者老爷子说什么“很有营养”之类的话了。",
        {
            "type": "showImage",
            "code": 3,
            "image": "dark.png",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 500
        },
        {
            "type": "text",
            "text": "\\c[20]泰拉1092年12月7日",
            "pos": [
                0,
                150,
                416
            ]
        },
        {
            "type": "hideImage",
            "code": 3,
            "time": 0
        },
        "那条路通往何处，我是很明白的。",
        "无论如何，我们必须走到那里，就算是我走不到，我也要让别人走到，要让叶莲娜走到，要让其他感染者走到。",
        "要让阿丽娜走到。",
        "哪怕我为之献身，我也在所不辞。",
        "这条路上可能有许多险阻，但我相信我可以度过。",
        "乌萨斯帝国的暴行让人民变得不再和他们的国家站在一起。",
        "倘若他们为民众提供食物，水，被褥，那么他们或许见到感染者便会向纠察队举报吧。",
        "不管怎么说......我认为，许多人是被逼着变成那样的。",
        "有人背叛了我们的队伍，也许只是因为他们想要自保吧，他们并没有错......",
        "现在，阿丽娜成为了感染者孩子们的老师，她讲的很好，至少我如此认为。",
        "如果有阿丽娜那样的老师在，有我们的队伍在，有感染者和普通人的和平共处在......他们会被改变。",
        "届时，我们便能抵达那个地方，走出属于我们感染者的一步。",
        {
            "type": "showImage",
            "code": 3,
            "image": "morningconutry.png",
            "loc": [
                -100,
                0
            ],
            "opacity": 1,
            "time": 1000
        },
        {
            "type": "showImage",
            "code": 4,
            "image": "alna.png",
            "loc": [
                -120,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        {
            "type": "showImage",
            "code": 5,
            "image": "tlla.png",
            "loc": [
                120,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        "\t[阿丽娜]\f[aln.png,-120,0]啊，塔露拉，早。",
        "\t[塔露拉]\f[tll.png,120,0]现在出去会不会有危险？",
        "\t[阿丽娜]\f[aln.png,-120,0]我问过战士们，纠察队应该都聚在西边的村子吧？前几天你们和他们的交流是不是被发现了？",
        "\t[塔露拉]\f[tll.png,120,0]这个可能。所以，暂时别往西边去了",
        "\t[阿丽娜]\f[aln.png,-120,0]我知道的，那东边这个村子，我们应该还是可以和他们换些东西的。",
        "\t[阿丽娜]\f[aln.png,-120,0]哎呀，别太担心，我们以前遇到的情况可比这危险多了。",
        "\t[阿丽娜]\f[aln.png,-120,0]而且，我们的食物也见底了，你不想再吃树根对吧？",
        "\t[塔露拉]\f[tll.png,120,0]但是我们可以自己获得......",
        "\t[阿丽娜]\f[aln.png,-120,0]我们需要水果、蔬果。",
        "\t[阿丽娜]\f[aln.png,-120,0]不然战士们会得病的。你也多学点生活方面的常识吧......",
        "\t[塔露拉]\f[tll.png,120,0]填饱肚子都很困难了，有些东西大概真不是那么......",
        "\t[阿丽娜]\f[aln.png,-120,0]不对，塔露拉，这可不对。",
        "\t[阿丽娜]\f[aln.png,-120,0]嗯哼，咳咳......",
        "\t[阿丽娜]\f[aln.png,-120,0]“正因为我们有时候吃不饱也穿不暖，所以那些诗歌、音乐、果实、鲜花，对味觉、视觉和嗅觉、触觉的渴望，才是可贵的。就是这些东西提醒着我们，我们是在为了让所有人过上什么样的生活而奋斗的。”",
        "\t[阿丽娜]\f[aln.png,-120,0]健康的蔬果当然就是其中的一部分♪",
        "\t[塔露拉]\f[tllx.png,120,0]......用我的说法反驳我，很狡诈。",
        "\t[塔露拉]\f[tllx.png,120,0]你去吧，需要人来保护你吗？",
        "\t[阿丽娜]\f[aln.png,-120,0]不太好。我又不是什么特别的感染者，因为我让我们暴露踪迹可不好。而且，我是比较容易隐藏自己身份的感染者，其他的战士们可不容易。",
        "\t[塔露拉]\f[tllx.png,120,0]那注意安全。那些村民也没那么值得信任......出尔反尔的事情发生得多了去了。",
        {
            "type": "showImage",
            "code": 1,
            "image": "dark.png",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 0
        },
        {
            "type": "hideImage",
            "code": 3,
            "time": 0
        },
        {
            "type": "hideImage",
            "code": 4,
            "time": 0
        },
        {
            "type": "hideImage",
            "code": 5,
            "time": 0
        },
        "\t[阿丽娜]那我就去啦",
        "\t[阿丽娜]雪怪们似乎喜欢吃苹果，我这次给他们多弄点苹果过来",
        "\t[阿丽娜]唔...还是山莓来着？",
        "\t[塔露拉]\f[tlln.png,0,0]阿丽娜！",
        "\t[阿丽娜]\f[aln.png,0,0]什么事？",
        "\t[塔露拉]\f[tllx.png,0,0]之后我准备组织一个感染者教育小组，你想当组长吗？",
        "\t[塔露拉]\f[tllx.png,0,0]在那些不是战士的感染者里，你的名声可比我要好,而那时候也比较容易向大家介绍你了。",
        "\t[阿丽娜]\f[alnj.png,0,0]我不是说......",
        "\t[塔露拉]\f[tllx.png,0,0]知识的战士也是战士，阿丽娜。这点我会坚持。",
        "\t[阿丽娜]\f[aln.png,0,0]那......看你安排吧。不会要写演讲辞吧？",
        "\t[塔露拉]\f[tllx.png,0,0]啊，我仿佛已经听到掌声了。",
        "\t[阿丽娜]......别揶揄我了。我去了。",
        "\t[塔露拉]再见。早点回来！",
        {
            "type": "changeFloor",
            "floorId": "MT42",
            "loc": [
                6,
                11
            ],
            "time": 0
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [

],
    "fgmap": [

]
}