main.floors.MT47=
{
    "floorId": "MT47",
    "title": "奔跑",
    "name": "亦或停下",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 4,
    "defaultGround": "X20000",
    "bgm": "bg.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,0": [
            {
                "type": "showImage",
                "code": 1,
                "image": "dark.png",
                "loc": [
                    0,
                    0
                ],
                "opacity": 1,
                "time": 0
            },
            {
                "type": "playSound",
                "name": "run.wav",
                "pitch": 120
            },
            {
                "type": "sleep",
                "time": 2000
            },
            "奔跑",
            "奔跑。",
            "长靴被冰水浸透。",
            "腿脚深陷进反射着刺眼光芒的雪地。",
            "忘记用雪橇。",
            "忘记骑上雪地车。",
            "将雪全都融化。",
            "在泥泞中奔跑。",
            {
                "type": "playSound",
                "name": "run.wav",
                "pitch": 120
            },
            {
                "type": "sleep",
                "time": 2000
            },
            {
                "type": "changeFloor",
                "floorId": "MT48",
                "loc": [
                    6,
                    12
                ]
            }
        ]
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [141,141,141,141,141,141, 91,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141]
],
    "bgmap": [

],
    "fgmap": [

],
    "weather": [
        "snow",
        8
    ]
}