main.floors.MT48=
{
    "floorId": "MT48",
    "title": "奔跑",
    "name": "亦或停下",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 4,
    "defaultGround": "X20000",
    "bgm": "bg.mp3",
    "firstArrive": [
        {
            "type": "showImage",
            "code": 1,
            "image": "dark.png",
            "loc": [
                0,
                0
            ],
            "opacity": 0.7,
            "time": 0
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,0": [
            {
                "type": "showImage",
                "code": 1,
                "image": "dark.png",
                "loc": [
                    0,
                    0
                ],
                "opacity": 1,
                "time": 0
            },
            {
                "type": "loadBgm",
                "name": "kuchu.mp3"
            },
            "不知走了多久。",
            "不知跑了多久。",
            "寒风钻入肺腑。",
            "痛觉刺入大脑。",
            "奔跑，还是奔跑。",
            "雪为什么还没有尽头。",
            "冬天为什么还没有尽头。",
            "大地为什么还没有尽头。",
            {
                "type": "showImage",
                "code": 2,
                "image": "iceforest.png",
                "loc": [
                    -100,
                    0
                ],
                "opacity": 1,
                "time": 1000
            },
            {
                "type": "playSound",
                "name": "tear.wav"
            },
            {
                "type": "sleep",
                "time": 1000
            },
            "什么声音?",
            {
                "type": "playSound",
                "name": "tear.wav"
            },
            {
                "type": "sleep",
                "time": 1000
            },
            "疲倦的身体对声音的辨析力已所剩无几。",
            {
                "type": "playSound",
                "name": "tear.wav"
            },
            {
                "type": "sleep",
                "time": 1000
            },
            "是......滴答声？",
            "\r[red]塔露拉停下了她的脚步。",
            {
                "type": "playSound",
                "name": "tear.wav"
            },
            "又是滴答声，不过这次，是塔露拉的泪水",
            "只不过，她本人似乎对此毫无知觉",
            "有知觉的，只有眼前的——",
            {
                "type": "playBgm",
                "name": "kuchu.mp3",
                "keep": true
            },
            {
                "type": "showImage",
                "code": 3,
                "image": "blood.png",
                "loc": [
                    0,
                    0
                ],
                "opacity": 1,
                "time": 0
            },
            {
                "type": "moveImage",
                "code": 3,
                "to": [
                    -150,
                    0
                ],
                "time": 5000,
                "async": true
            },
            "阿丽娜就那样倒在路旁。",
            "她紧攥着手中的空篮，鲜血浸湿了她的衣裳。",
            "将她身旁深掩住草木与泥土的惨白也一同染成了暗淡红色。",
            "雪就这么下着。",
            {
                "type": "hideImage",
                "code": 3,
                "time": 0
            },
            "\t[塔露拉]\f[tlls.png,-90,0]......",
            "\t[塔露拉]\f[tlls.png,-90,0]阿......阿......",
            "\t[阿丽娜]\f[alnd.png,-90,0]......",
            "\t[阿丽娜]\f[alnd.png,-90,0]塔露......拉？",
            "\t[塔露拉]\f[tlls.png,-90,0]阿丽娜......！！！",
            "\t[阿丽娜]\f[alnd.png,-90,0]真不想......让你看到我这样。",
            "\t[塔露拉]\f[tlls.png,-90,0]别说话！阿丽娜，别说话......别说话！",
            "\t[塔露拉]\f[tlls.png,-90,0]我帮你止血......！我帮你......！",
            "\t[阿丽娜]\f[alnd.png,-90,0]已经......没有再流血了......只是.....",
            "\t[塔露拉]\f[tlls.png,-90,0]那我们走......我们走！叫医护兵给你输血！",
            "\t[阿丽娜]\f[alnd.png,-90,0]没关系......不过......换来的东西被......",
            "\t[塔露拉]\f[tlln.png,0,40]别管了......别管了......我带你走......带你走！！！",
            "德拉克背起了埃拉菲亚。只有这时候，她才惊觉，这只轻盈的小鹿，竟然这么重，这么重......",
            "简直就像是，背起了这片大地，这个世界一样。",
            "\t[阿丽娜]\f[alnd.png,-90,0]不用再......",
            "\t[塔露拉]\f[tlln.png,0,40]不可能！",
            "\t[塔露拉]\f[tlln.png,0,40]谁干的......谁干的......谁干的？！",
            "\t[塔露拉]\f[tlln.png,0,40]是纠察队......？！是那些村民？！那些混蛋......那些混蛋......我要烧死他们......我......",
            "\t[塔露拉]\f[tlln.png,0,40]等等，难道是......那些被赶走的感染者......！",
            "\t[塔露拉]\f[tlln.png,0,40]这些忘恩负义的......不，不，如果盾卫肯分给他们口粮......",
            {
                "type": "showImage",
                "code": 3,
                "image": "dead1.png",
                "loc": [
                    -50,
                    -34
                ],
                "opacity": 1,
                "time": 0
            },
            "\t[阿丽娜]......塔露拉",
            "\t[塔露拉]我在听，阿丽娜，我在听！",
            "\t[阿丽娜]我......不会告诉你！",
            "\t[塔露拉]\\c[20]为什么？！为什么？！！我难道连为你报仇都做不到吗！！",
            "\t[阿丽娜]不准......你自己说的怎么能忘记？",
            "\t[阿丽娜]你怎么能为了报仇去战斗？你已经选了，塔露拉，你已经选了一条路......",
            "\t[阿丽娜]你已经走出了属于你的一步，属于我们感染者的一步......",
            "\t[阿丽娜]为我......半途而废......？我不接受......",
            "\t[阿丽娜]不准......去恨谁。",
            "\t[塔露拉]\\c[20]你说什么，你说什么！我怎么做得到......怎么做得到！！！",
            "\t[阿丽娜]你对我说过......说过你的故事......",
            "\t[阿丽娜]你自己说过......！你不能去恨任何人......！否则你就会被......那个诅咒你的老人......吞噬......",
            "\t[阿丽娜]......哪怕那个法术从来都不存在，你不也是会......被他代表的那些东西......操控？",
            "\t[塔露拉]对......对。可是......可是......那些人......那些......",
            "\t[阿丽娜]......你也知道他们都从哪里来，又是......为什么这么做。",
            "\t[阿丽娜]你自己也说过......你面对的不是这些......敌人......",
            "\t[阿丽娜]我记得......你还说过......",
            "\t[塔露拉]别说了！阿丽娜......别说了......别说了！",
            "\t[阿丽娜]你要打碎的......不是这些人......是把他们逼成这样，造成这样的......乌萨斯......",
            "\t[阿丽娜]你的敌人是......乌萨斯......是这片不公的......大地......",
            "\t[塔露拉]可以了......可以了，阿丽娜......可以了！",
            "\t[阿丽娜]只有你，塔露拉......你可以厌恶一件事......他们做的事情，你可以痛恨......",
            "\t[阿丽娜]但是，你不能去恨......一个人。",
            "\t[阿丽娜]我不清楚......那个诅咒到底是什么......但是我知道——",
            "\t[阿丽娜]你的愤怒......可以烧遍荒野......但你不可以去恨......",
            "\t[阿丽娜]......",
            "\t[塔露拉]阿丽娜......",
            {
                "type": "showImage",
                "code": 4,
                "image": "dark.png",
                "loc": [
                    0,
                    0
                ],
                "opacity": 1,
                "time": 1000
            },
            {
                "type": "showImage",
                "code": 3,
                "image": "dead2.png",
                "loc": [
                    -50,
                    -34
                ],
                "opacity": 1,
                "time": 0
            },
            "\t[阿丽娜]阿，塔露拉，我好担心。如果我不在了，你一定要让叶莲娜提醒你......这些都是......",
            "\t[阿丽娜]阿，塔露拉，我好害怕。我不想和你分开，我还想看着你继续往前走......",
            "\t[塔露拉]我不想失去你！任何人我都不想失去！还有叶莲娜，爱国者......你们每一个我都不能......",
            "\t[塔露拉]\\c[25]我都不想失去啊！！！！！",
            "\t[阿丽娜]阿阿，塔露拉......可是我们所有人......",
            "\t[阿丽娜]相逢，就是为了......",
            {
                "type": "hideImage",
                "code": 4,
                "time": 1000
            },
            "\t[阿丽娜]\r[gray]离......别......",
            "\t[塔露拉]\\c[25]不要闭眼......不要闭上眼！",
            "\t[塔露拉]\\c[25]我们快到了，阿丽娜.....我们就快到......",
            "\t[塔露拉]\r[gray]\\c[20]阿丽......娜？",
            {
                "type": "waitAsync",
                "includeSounds": true
            },
            {
                "type": "hideImage",
                "code": 3,
                "time": 0
            },
            {
                "type": "hideImage",
                "code": 2,
                "time": 0
            },
            "后面的记忆，塔露拉是模糊的。",
            "\t[雪怪小队成员] ......这......你背着的那是......",
            "\t[雪怪小队成员]啊，她已经没气了！医护兵！快来再检查一下！塔露拉，你等下......",
            "塔露拉本该记得十分清楚的一切，都随着雪花一起融化。",
            "\t[雪怪小队成员]......塔露拉？",
            "\t[雪怪小队成员]（哎，她怎么只是一个劲地往前走......她去哪？！）",
            "她留下了一条火径，她背后的一切，除了阿丽娜，都在烈火中消失殆尽。",
            "\t[霜星]......让她去吧。",
            "\t[盾卫]（你认识那个可怜的姑娘吗......？）",
            "\t[霜星]（不太认识。似乎......是聚落里的一个老师。）",
            "\t[盾卫]（啊，老师。孩子们又失去了一个好人。）",
            "\t[盾卫]（可塔露拉为什么......）",
            "在众人的目视下，德拉克背着埃拉菲亚走过驻地，她们的身影慢慢地不再分明，逐渐隐没在森林边缘。",
            "没人知道后来发生了什么。",
            "他们只是看着，看着塔露拉步入黑夜。",
            {
                "type": "changeFloor",
                "floorId": "MT49",
                "loc": [
                    6,
                    12
                ]
            }
        ]
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  0,  0,  0,  0, 17, 91, 17,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0, 17,  0, 17,  0,  0,  0,  0,  0]
],
    "bgmap": [
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141],
    [141,141,141,141,141,141,  0,141,141,141,141,141,141]
],
    "fgmap": [

],
    "weather": [
        "snow",
        9
    ]
}