main.floors.MT51=
{
    "floorId": "MT51",
    "title": "心灵之间",
    "name": "心灵之间",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 5,
    "defaultGround": "ground3",
    "bgm": "bg.mp3",
    "firstArrive": [
        "\\c[20]泰拉1092年。",
        "\t[未知的声音]哦？",
        "\t[未知的声音]看来，你改变主意了？",
        "\t[塔露拉]\f[fairy.png,0,0]当然没有，我只是想......看一些东西。",
        "\t[未知的声音]哦，当然可以，我的孩子。",
        "\t[未知的声音]你甚至可以一边进行现实世界的活动，一边浏览这里，完全没有问题。",
        "\t[塔露拉]\f[tllf.png,0,0]你这个论调真的恶心透顶。",
        {
            "type": "hideImage",
            "code": 1,
            "time": 0
        },
        "\t[未知的声音]随意探索吧，这里的大门始终是敞开的，不过这个空间或许会游荡一些鬼魂，当然了，如果你在这里死掉，虽然不会真的死掉，但你的精神会变得十分脆弱。",
        "\t[未知的声音]各种场景都会交织在这里，甚至现实世界中发生的事情也会，你——",
        "\t[塔露拉]\f[tlln.png,0,0]闭嘴!",
        "\t[塔露拉]\f[tllb.png,0,0](......我就看一眼，一眼......）"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,0": {
            "floorId": "MT52",
            "loc": [
                11,
                11
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [311,311,311,311,311,311, 89,311,311,311,311,311,311],
    [311, 33, 81,  0, 33, 34,  0,237, 30, 29, 27, 28,311],
    [311,311,311,211,311,311,311,311, 82,311,311,311,311],
    [311,  0, 31,  0, 32,  0, 33,  0, 32,  0,  0, 27,311],
    [311,311,311,311, 81,311,311,311,311,210,311,311,311],
    [311, 32, 32,209,  0,  0, 29,  0,209,  0, 29,  0,311],
    [311,311,311,311,311,212,311,311,311, 81,311,311,311],
    [311, 27, 30,211, 81,  0, 32,  0, 31,  0, 32,  0,311],
    [311,311,311, 82,311,311,311,210,311,311,311,311,311],
    [311, 32,  0, 34,  0, 32,  0, 29,  0, 81, 34, 32,311],
    [311,311,209,311,311,311,311,311,311,311,311,311,311],
    [311, 30,  0, 21,  0, 34,  0, 81,212, 28, 27, 21,311],
    [311,311,311,311,311,311,  0,311,311,311,311,311,311]
],
    "bgmap": [

],
    "fgmap": [

]
}